{
  "data": {
    "path": "http://3blpronew.docksal.site",
    "sucess": 1,
    "widget_name": "3BL Alerts",
    "token": "43385276c8b639cb8dcfff37c3178c1e",
    "widget_id": "NTEw",
    "widget_viewmore_link": "More News...",
    "settings": {
      "widget_width_height_in": "0",
      "mini-widget-layout": null,
      "primary-widget-layout": null,
      "widget_height": "840",
      "widget_width": "800",
      "widget_no_post": "28",
      "widget_front_title": "Latest Corporate Responsibility News",
      "widget_list_title": "Latest Corporate Responsibility News",
      "widget_viewmore_text": "More News...",
      "widget_no_more_posts": "23",
      "widget_viewmore_link": "http://reportalert.info/3blmedianews/",
      "widget_video_width": null,
      "widget_poweredBy": 0,
      "widget_listpageDesc_limit": "300",
      "widget_frontpageTitle_limit": "100",
      "primary-widget-title-max-length": null,
      "widget_frontpage_desc_limit": "300",
      "widget_frontpage_desc": "3BL Alerts provides announcements of the latest company–issued Corporate Responsibility (CR) and Sustainability Reports. The announcements are provided by the company or organization issuing the new CR or Sustainability Report. They include website links to the report being announced together with relevant contact details.",
      "suppress_our_css": "1",
      "strWidgetDateFormat": "d M Y",
      "widget_fmr_in_tab": "",
      "strWidgetImageSize": "mediam"
    },
    "intPageNo": 1,
    "intFDPageNo": 1,
    "intLimit": "28",
    "boolFrontPageThumb": "1",
    "boolListPageThumb": "1",
    "intFrontPageThumbWidth": "100",
    "widget_version": "1",
    "widget_css": "/* CSS for Frontpage Title*/\n               #threeblmediawidget h2.threebl_title {color:#797878;font-size:22px; margin-top: 10px;text-transform: uppercase;}\n\n                /* CSS for Frontpage Headline */\n                #threeblmediawidget ul li h2 a.threebl_fmr_headlines{color:#231F20;font-size:22px;margin: 0;padding: 0;\n                vertical-align: middle;line-height:26px;text-decoration:none}\n                #threeblmediawidget ul li h2 a.threebl_fmr_headlines:hover{color:#231F20;font-size:22px;margin: 0;padding: 0;vertical-align: middle; line-height:26px;}\n\n                /* CSS for Date and Time */\n                #threeblmediawidget .threebl_datetime {color:#797878 !important; font-size:13px !important; padding: 5px 0; display:;}\n\n                /* CSS for View more link */\n                #threeblmediawidget ul li a.threebl_vew_more{color:#797878;font-size:px;}\n                #threeblmediawidget ul li a.threebl_vew_more:hover {color:#ED1C24;font-size:px ;}\n\n                /* CSS for Headline blocks*/\n                #threeblmediawidget ul {list-style:none;}\n                #threeblmediawidget ul.threebl_sidebar{ list-style:none; padding:0 10px; font-family:\"Droid Serif\", Geneva, Arial, Helvetica, sans-serif;}\n                #threeblmediawidget ul.threebl_sidebar li{ padding:10px 0; border-bottom:1px dotted #ccc}\n                #threeblmediawidget ul.threebl_sidebar li.threebl_border-none{ border:none}{ padding:10px 0; border-bottom:1px dotted #fff;}\n\n                /* CSS for anchor tag*/\n                #threeblmediawidget ul.threebl_sidebar a{text-decoration:none; display:block; color:#00AACC;}\n                #threeblmediawidget ul.threebl_sidebar a:hover{ color:#00AACC; text-decoration:none;}\n\n                /* CSS for Read more link */\n                #threeblmediawidget ul.threebl_sidebar li .threebl_view-more{ text-align:right; font-size:11px;}\n\n                /* CSS for Powered By 3BLMedia.com */\n                #threeblmediawidget .threebl_link a {color:#444444 !important;font-size:13px; text-decoration:none}\n                #threeblmediawidget ul.threebl_sidebar a.threebl_read_more{display: inline;}\n\n                /* css for front page thumbnail width*/\n                #threeblmediawidget ul.threebl_sidebar div.thumbnailWidth{width: 16% !important;display: inline-block !important;box-sizing: border-box !important;\nvertical-align: top;}\n                                    #threeblmediawidget ul.threebl_sidebar div.thumbnailWidth img{width:100% !important}\n                                    #threeblmediawidget ul.threebl_sidebar div.rightdivwidth{width: calc(80% - 10px) !important;display: inline-block !important;}\n\n                 /* css for front page teaser*/\n                #threeblmediawidget ul.threebl_sidebar div.threebl_frontdesc{color:#A0A0A0;width: calc(80% - 10px) !important;line-height: 16px;display: inline-block !important;font-size :13px}\n\n                /* Common classes */\n                #threeblmediawidget {color:#333; font-family:\"Droid Serif\", Geneva, Arial, Helvetica, sans-serif;font-size:12px;padding: 0 20px; }\n                #threeblmediawidget h1, #threeblmediawidget h2, #threeblmediawidget h3{ padding:0; margin:0; font-family:\"Droid Serif\", Geneva, Arial, Helvetica, sans-serif }\n                #threeblmediawidget a:link, #threeblmediawidget a:visited, #threeblmediawidget a:hover, #threeblmediawidget a:active {color:#00AACC;}#threeblmediawidget ul.threebl_sidebar a {color:#666666;}\r\n#threeblmediawidget ul.threebl_sidebar a:hover {color:#ED1C24;}\r\n#threeblmediawidget ul.threebl_sidebar div.fmrImageDiv{margin-top:10px}",
    "is_featured": null,
    "arrContentList": [],
    "arrCompany": [],
    "arrCompanyName": [],
    "intCnt": "22792",
    "arrFMRContentList": [
      {
        "fmr_id": "1253721",
        "published_date": "2024-03-20T20:30:00",
        "company_nid": "1546",
        "mediatype": "article",
        "fmr_list": {
          "companyName": "Marathon Petroleum Corporation",
          "companyLink": "https://www.3blmedia.com/profiles/marathon-petroleum-corporation",
          "id": "1253721",
          "title": "Firefighter Academy Gives Students a Head Start",
          "type": "article",
          "publishedDate": "2024-03-20T20:30:00-04:00",
          "shortTeaser": "A grant from Marathon Petroleum’s Dickinson renewable diesel facility is helping the fire department provide equipment for students who enroll in the course.",
          "description": "<ul><li><strong>Some North Dakota teenagers are getting first-hand experience with the skills they would need to become professional firefighters.</strong></li><li><strong>The city of Dickinson's fire department conducts a certification course for high school students, qualifying them for college credit and positioning them to apply for jobs in firefighting.</strong></li><li><strong>A grant from Marathon Petroleum's Dickinson renewable diesel facility is helping the fire department provide equipment for students who enroll in the course.</strong></li></ul><p>High school students in southwestern North Dakota who want to become firefighters don't have to wait to find out what it's like. A two-semester course taught by the <a href=\"https://www.dickinsongov.com/fire\" target=\"_blank\" title=\"city of Dickinson's fire department\" rel=\"noopener noreferrer\">city of Dickinson's fire department</a> offers students opportunities to earn certification for entering the field. Using the same tools and equipment as professional firefighters is essential to the program, which prompted a recent $2,000 grant to the fire department from Marathon Petroleum's Dickinson renewable diesel facility.</p><p>\"In the future, we might be working side by side with these students if we ever need to call upon outside help or are asked to assist another department.\"</p><p>\"The city's fire department provides personal protective equipment for the students, which is quite costly, and this grant will help with some of that expense,\" said the renewable diesel facility's Interim Fire Chief Nate Eberle.</p><p>The city fire department's Firefighter 1 Academy course is administered through the <a href=\"https://www.ractc.org/\" target=\"_blank\" title=\"Roughrider Area Career and Technical Center\" rel=\"noopener noreferrer\">Roughrider Area Career and Technical Center</a>, a regional facility that serves schools from 12 area communities. Completing the course gives students options when deciding which direction to take after graduating from high school. They qualify for credits toward a fire science degree at Dickinson State University and are also in position to pursue jobs with fire departments.</p><p>\"Most departments in the state will require, at minimum, Firefighter 1 certification, which is what students will get after they have successfully completed the cognitive and practical exams,\" said Eberle. \"This program also offers Firefighter 2 certification as a possibility for students.\"</p><p>The grant from the Dickinson renewable diesel facility adds to its ongoing support for the local community and first responders throughout the area. The facility's fire brigade maintains a mutual aid agreement with all surrounding fire departments in Stark County, meaning they will provide resources and equipment to each other, as needed, during emergencies. Eberle pointed out how the grant brings it all full circle.</p><p>\"In the future, we might be working side by side with these students if we ever need to call upon outside help or are asked to assist another department,\" he said.</p>",
          "linkTo3BL": "https://www.3blmedia.com/",
          "thumbnailLink": "https://www.3blmedia.com/sites/default/files/styles/thumbnail/public/images/firefighterAcademy_Marathon_032024.png",
          "mediumPhotoLink": "https://www.3blmedia.com/sites/default/files/styles/medium/public/images/firefighterAcademy_Marathon_032024.png",
          "imageALT": "\\\" \\\""
        },
        "fmr_details": {
          "resourceLink": null,
          "resourceText": null,
          "subtitle": "",
          "twitter": null,
          "campaignTitle": null,
          "campaignLink": null,
          "contactInformation": null,
          "multimedia": {
            "images": [
              {
                "originalLink": "https://www.3blmedia.com/sites/default/files/styles/fmr_page_photos_blog/public/images/firefighterAcademy_Marathon_032024.png",
                "thumbnailLink": "https://www.3blmedia.com/sites/default/files/styles/thumbnail/public/images/firefighterAcademy_Marathon_032024.png",
                "mediumLink": "https://www.3blmedia.com/sites/default/files/styles/medium/public/images/firefighterAcademy_Marathon_032024.png",
                "title": "\\\" \\\"",
                "detailsLink": "public://images/firefighterAcademy_Marathon_032024.png",
                "imageALT": "\\\" \\\""
              },
              {
                "originalLink": "https://www.3blmedia.com/sites/default/files/styles/fmr_page_photos_blog/public/images/FirefighterAcademyGrant_marathon.png",
                "thumbnailLink": "https://www.3blmedia.com/sites/default/files/styles/thumbnail/public/images/FirefighterAcademyGrant_marathon.png",
                "mediumLink": "https://www.3blmedia.com/sites/default/files/styles/medium/public/images/FirefighterAcademyGrant_marathon.png",
                "title": "\\\" \\\"",
                "detailsLink": "public://images/FirefighterAcademyGrant_marathon.png",
                "imageALT": "\\\" \\\""
              }
            ],
            "video": [],
            "audio": [],
            "document": []
          },
          "blogUrl": {
            "link": null,
            "title": null
          },
          "templateType": "classic",
          "imageUrl": "https://www.3blmedia.com/sites/default/files/styles/fmr_page_photos_mm_medium/public/images/firefighterAcademy_Marathon_032024.png",
          "displayTwitter": "none"
        }
      },
      {
        "fmr_id": "1253716",
        "published_date": "2024-03-20T19:00:00",
        "company_nid": "10106",
        "mediatype": "blog",
        "fmr_list": {
          "companyName": "South Pole",
          "companyLink": "https://www.3blmedia.com/profiles/south-pole",
          "id": "1253716",
          "title": "The TNFD Framework: A Crucial Catalyst for Corporate Biodiversity Action",
          "type": "blog",
          "publishedDate": "2024-03-20T19:00:00-04:00",
          "shortTeaser": "As the world grapples with existential threats like climate change and biodiversity loss, the spotlight is increasingly turning toward the role of corporations in shaping our sustainable future.",
          "description": "<p><strong>As the world grapples with existential threats like climate change and biodiversity loss, the spotlight is increasingly turning toward the role of corporations in shaping our sustainable future.</strong></p><p>In this context, last year's New York Climate Week was a monumental occasion. One of its standout events was the public webinar hosted by the Taskforce on Nature-related Financial Disclosures (TNFD). It marked the culmination of two years of development, four beta releases, and more than 3000 pieces of feedback. This event unveiled TNFD's finalized disclosure recommendations and metrics, making it a must-watch for any corporation seeking to mitigate its biodiversity impact.</p><p>In this article, we'll delve into why the TNFD framework is indispensable for corporate sustainability.</p><p><strong>What is the TNFD?</strong></p><p>Founded to mitigate nature-related risks and drive meaningful action, the Taskforce on Nature-related Financial Disclosures (TNFD) has been a remarkable initiative. Its goal is to provide organizations with a comprehensive framework to report, locate, estimate and assess their nature-related risks. These risks include severe droughts, the disappearance of pollinators, or disruption of supply chains, due to overexploitation of biodiversity and ecosystem services.</p><p>Over a two-year developmental phase that included multiple beta releases and extensive community input, the TNFD has emerged as a robust, transparent, and adaptable framework. Not merely a policy document or a list of best practices, the TNFD is an integrated roadmap that is designed to make biodiversity concerns an integral part of corporate decision-making. With this roadmap businesses can chart the course towards reducing their impact on nature, minimise risks of biodiversity loss and ensure they are resilient to climate and environmental shocks.</p><p><strong>Why the TNFD is ImportantStandardising Disclosure</strong></p><p>One of the greatest barriers to biodiversity action within the corporate sphere has been the lack of standardised disclosure norms. Many different methods and metrics have made it challenging for investors and stakeholders to gauge the real impact of companies on biodiversity.</p><p>Enter the TNFD. Its framework offers a standardised methodology that enables a uniform, accurate portrayal of a company's environmental impact. This, in turn, allows stakeholders to make more informed decisions and levels the playing field for companies themselves, as they can better understand how they compare to peers in the industry.</p><p><strong>Guiding Investments</strong></p><p>Beyond disclosures, the TNFD framework is a strategic guide for corporations and financial institutions to funnel their investments.The TNFD offers guidelines for companies to understand its impacts and dependencies and translate them into risks and opportunities to allocate investments that are aligned with broader global sustainability goals, such as the Global Biodiversity Framework, or the UN's Sustainable Development Goals. It creates a ripple effect-disclosure prompts awareness, awareness prompts action, and action brings change.</p><p><strong>Enhancing Corporate Accountability and materiality approach aligned with main relevant standards</strong></p><p>Corporate accountability is another domain where the TNFD framework is poised to make impacts. Making companies more accountable for their actions on biodiversity loss puts a mechanism in place that raises internal corporate awareness of where major impacts can occur on the companies' direct operations and value chain.</p><p>This accountability not only nudges companies towards positive action but also reassures investors and stakeholders that their involvement leads to tangible environmental benefits. In this sense, TNFD is based on the principle of double materiality, or the financial value of a company as well as it's impact on the world, including biodiversity.</p><p>TNFD recommendations accommodate the different approaches to materiality under the ISSB´s IFRS Standards and TCFD recommendations, meeting the material information needed by capital providers, but also meeting the material information needed by stakeholders focused on impacts, aligned with a broader materiality approach, consistent with the GRI standards.</p><p><strong>How It's Going So Far</strong></p><p>TNFD proposes a \"leading indicators\" approach to measurement. This approach leverages the best available science and cross-referencing metrics already in use by market participants through organisations such as Sustainability Accounting Standards Board ( now part of the International Financial Reporting Standards Foundation),Global Reporting Initiative and European Financial Reporting Advisory Group. They incorporate cross-sector and sector-specific metrics to provide a flexible approach for report preparers and a basis for comparative analysis by report users.</p><p>TNFD encourages the implementation of the <strong>LEAP (Locate, Estimate, Assess, Prepare) </strong>approach to better implement nature-related risks into the company's decision-making process. The <strong>LEAP Approach,</strong> in particular, offers companies a structured way to understand the complexity of their impacts and dependencies, identify risks and opportunities material to the company, engage with stakeholders, and set measurable goals. The latest version of the methodology prioritises Indigenous People and Local Communities. These include recommendations to disclose the level and scope of engagement that the companies maintain with Indigenous People and Local Communities. In the case of target setting, the TNFD recommends the use of the Science Based Targets Network (SBTN) guidance.</p><p><strong>TNFD and SBTN. How do they fit together?</strong></p><p>The SBTN and TNFD operate in related yet distinct capacities and have a mutually reinforcing relationship. SBTN provides the scientific grounding, and TNFD offers the financial framework for transparent disclosure and accountability, making both indispensable in the corporate quest for sustainability. The SBTN and TNFD work together by:</p><ol><li><strong>Aligning targets with financial risks:</strong> the science-based targets endorsed by SBTN can be used as benchmarks against which financial risks and opportunities are assessed in the TNFD framework. A company adhering to SBTN targets is likely to perform better in TNFD disclosures, showing less nature-related risk.<br>&nbsp;</li><li><strong>Data and metrics</strong>: both initiatives are likely to benefit from shared data, insights, and methodologies that improve the accuracy and relevance of nature-related metrics. TNFD can employ science-based metrics established by SBTN in its disclosure guidelines.<br>&nbsp;</li><li><strong>Leveraging stakeholder engagement:</strong> SBTN and TNFD can collaborate in stakeholder engagement activities, given their overlapping target audiences, which include corporates, financial institutions, and policy-makers.<br>&nbsp;</li><li><strong>Integrating reporting</strong>: organisations could feasibly integrate their science-based targets into their TNFD disclosures, making for a more comprehensive and credible sustainability report.<br>&nbsp;</li><li><strong>Policy synergy:</strong> given that both initiatives are multi-stakeholder and multi-disciplinary, they can mutually benefit from policy advocacy, urging governments and regulators to adopt frameworks that protect nature and ensure sustainable development.</li></ol><p>As the SBTN target methods continue their development, they will generate data that will help companies to apply parts of the TNFD LEAP approach for the assessment of nature-related issues and to disclose in line with the TNFD recommendations.</p><p><strong>What Are the Next Steps?</strong></p><p>Any company, from any sector is encouraged to kick off its journey in biodiversity corporate action by implementing the TNFD. Yet, if the company does not possess the right quantity and quality of data to conduct an appropriate assessment, the important goal is to make a start since the refinement will come later, as companies become more aware of their impacts and dependencies and they set adequate data management systems to better support future iterations in the implementation of the TNFD framework. The first step is to internalise the framework by training and increasing knowledge across all key departments. Then comes the actual task of implementation-setting targets based on TNFD metrics, monitoring performance, and making adjustments as needed.</p><p>The TNFD will also continue to gather data, feedback, and adapt. Future iterations will likely integrate even more community feedback and real-world case studies, thereby refining the framework into an even more effective tool for corporate sustainability.</p><p>As we approach COP16 in Cali, Colombia, the Task Force on Nature-related Financial Disclosures (TNFD) stands as a beacon of hope and opportunity in the nexus between climate change and biodiversity loss. The TNFD is not just a set of recommendations; it's a living, breathing framework that will continue to evolve. It's designed to permeate the very DNA of a corporation's strategy, operations, risk management and financial planning. The release of the final recommendations in September 2023 was a pivotal moment for companies to fully grasp these final recommendations and either kick-start or significantly enhance their own biodiversity journey. With the tools and the responsibility now clearly laid out, companies have a pathway to start their journey in corporate biodiversity action. Let's seize this opportunity for transformative action and lasting impact.</p>",
          "linkTo3BL": "https://www.3blmedia.com/",
          "thumbnailLink": "https://www.3blmedia.com/sites/default/files/styles/thumbnail/public/images/elephant-1822636-1920_1440x1325.jpg",
          "mediumPhotoLink": "https://www.3blmedia.com/sites/default/files/styles/medium/public/images/elephant-1822636-1920_1440x1325.jpg",
          "imageALT": "Biodiversity"
        },
        "fmr_details": {
          "resourceLink": null,
          "resourceText": null,
          "subtitle": "",
          "twitter": null,
          "campaignTitle": null,
          "campaignLink": null,
          "contactInformation": null,
          "multimedia": {
            "images": [
              {
                "originalLink": "https://www.3blmedia.com/sites/default/files/styles/fmr_page_photos_blog/public/images/elephant-1822636-1920_1440x1325.jpg",
                "thumbnailLink": "https://www.3blmedia.com/sites/default/files/styles/thumbnail/public/images/elephant-1822636-1920_1440x1325.jpg",
                "mediumLink": "https://www.3blmedia.com/sites/default/files/styles/medium/public/images/elephant-1822636-1920_1440x1325.jpg",
                "title": "Biodiversity",
                "detailsLink": "public://images/elephant-1822636-1920_1440x1325.jpg",
                "imageALT": "Biodiversity"
              }
            ],
            "video": [],
            "audio": [],
            "document": []
          },
          "blogUrl": {
            "link": null,
            "title": null
          },
          "templateType": "classic",
          "imageUrl": "https://www.3blmedia.com/sites/default/files/styles/fmr_page_photos_mm_medium/public/images/elephant-1822636-1920_1440x1325.jpg",
          "displayTwitter": "none"
        }
      },
      {
        "fmr_id": "1253686",
        "published_date": "2024-03-20T18:25:00",
        "company_nid": "1441",
        "mediatype": "article",
        "fmr_list": {
          "companyName": "International WELL Building Institute ",
          "companyLink": "https://www.3blmedia.com/profiles/international-well-building-institute",
          "id": "1253686",
          "title": "Advancing Workplaces Where Women Thrive",
          "type": "article",
          "publishedDate": "2024-03-20T18:25:00-04:00",
          "shortTeaser": "At the heart of our mission lies a commitment to creating a more equitable and just world by transforming communities through people-first spaces. ",
          "description": "<p>At the heart of our mission lies a commitment to creating a more equitable and just world by transforming communities through people-first spaces. Central to this is integrating gender equity into the fabric of our work, advancing workplaces that are not just inclusive, but actively supportive of women.</p><p>Numerous features within the <a href=\"https://v2.wellcertified.com/en/wellv2/concepts\" target=\"_blank\">WELL Standard</a> address gender equity in the workplace, from spaces and resources that support breastfeeding parents to policies that ensure pay equity. Current beta features also reward organizations for providing <a href=\"https://v2.wellcertified.com/en/wellv2/community/feature/6\" target=\"_blank\">enhanced health benefits</a>, including reproductive services and care, often excluded or only partially covered in many employer based health plans. Moreover, WELL strategies support women-and all individuals-<a href=\"https://v2.wellcertified.com/en/wellv2/community/feature/18\" target=\"_blank\">impacted</a> by domestic violence, further proof that a rising tide lifts all boats. Other WELL features address sufficient amounts of parental leave based upon research showing the positive impact of parental leave on both the well-being of the child and job continuity for women. In fact, encouraging the use of paternity leave is particularly crucial, as it helps level the playing field for women by not only promoting shared responsibility in caregiving, but also enhancing family bonding and better supporting equality in the workplace.</p><p>At IWBI, we view every step forward, including across each of our 74,000 commercial and residential locations that participate in WELL programs, as progress toward fostering change that promotes equity. And the future holds even greater possibilities, with extensive opportunities to deepen our commitments and drive greater impact.</p><p><a href=\"https://resources.wellcertified.com/articles/the-fight-for-equality-one-organization-s-commitment-to-achieve-the-well-equity-rating/\" target=\"_blank\">Woonerf</a> was the first organization in the world to achieve the WELL Equity Rating, a framework that helps companies take action toward their diversity, equity, inclusion and accessibility goals, while improving company culture and employee health and well-being. On its career page, Woonerf showcases its values, clearly articulating benefits that align with or are based upon WELL features. They share employee statistics, including the rate of parental leave taken for those eligible. The figure of those who took leave? 100%.</p><p>And for us, creating a workplace where women can thrive isn't just a goal-it's our reality. IWBI's executive team is majority female, with women comprising nearly 60% of our leadership. Research has shown that well-being and sustainability are topics where women historically feel a greater sense of inclusion, which is reflected across our global organization, as women make up a whopping 86% of our workforce. This representation at the top not only fosters diversity, but also serves as a powerful catalyst for attracting female talent, as women see themselves reflected in the leadership landscape.</p><p>But it's not just about numbers-it's about creating environments where everyone feels welcomed, supported and empowered to be their best selves. According to <a href=\"https://resources.wellcertified.com/press-releases/employees-deeply-value-health-and-well-being-finds-iwbi-s-2023-state-of-workforce-well-being-poll/\" target=\"_blank\">IWBI's 2023 State of Workforce Well-Being Poll</a>, conducted by The Harris Poll, female employees are more likely than males to feel most productive outside of a company-provided office-a nod to the case for hybrid and remote-work models, and an important signal to organizations to offer flexibility to their employees.</p><p>Designing workplaces with women in mind isn't just a win for women-<a href=\"https://www.wellcertified.com/equity/\" target=\"_blank\">it's a win for everyone</a>. By prioritizing gender equity in workplace design, we're not only creating, and inspiring the creation of, healthier and more vibrant communities, but leading the way toward a more equitable and inclusive future for all.</p><p>View original content <a href=\"https://resources.wellcertified.com/articles/advancing-workplaces-where-women-thrive-2024/\" target=\"_blank\">here</a>.</p>",
          "linkTo3BL": "https://www.3blmedia.com/",
          "thumbnailLink": "https://www.3blmedia.com/sites/default/files/styles/thumbnail/public/images/womencollage_IWBI_032024.png",
          "mediumPhotoLink": "https://www.3blmedia.com/sites/default/files/styles/medium/public/images/womencollage_IWBI_032024.png",
          "imageALT": "collage of women"
        },
        "fmr_details": {
          "resourceLink": null,
          "resourceText": null,
          "subtitle": "Creating more inclusive spaces for a brighter future (no matter the month)",
          "twitter": null,
          "campaignTitle": "IWBI | Equity",
          "campaignLink": "https://www.3blmedia.com/news/campaign/iwbi-equity",
          "contactInformation": null,
          "multimedia": {
            "images": [
              {
                "originalLink": "https://www.3blmedia.com/sites/default/files/styles/fmr_page_photos_blog/public/images/womencollage_IWBI_032024.png",
                "thumbnailLink": "https://www.3blmedia.com/sites/default/files/styles/thumbnail/public/images/womencollage_IWBI_032024.png",
                "mediumLink": "https://www.3blmedia.com/sites/default/files/styles/medium/public/images/womencollage_IWBI_032024.png",
                "title": "\\\"Building Workplaces for Women, by Women\\\" with collage of women",
                "detailsLink": "public://images/womencollage_IWBI_032024.png",
                "imageALT": "\\\"Building Workplaces for Women, by Women\\\" with collage of women"
              },
              {
                "originalLink": "https://www.3blmedia.com/sites/default/files/styles/fmr_page_photos_blog/public/images/womancollage2_IWBI_032024.png",
                "thumbnailLink": "https://www.3blmedia.com/sites/default/files/styles/thumbnail/public/images/womancollage2_IWBI_032024.png",
                "mediumLink": "https://www.3blmedia.com/sites/default/files/styles/medium/public/images/womancollage2_IWBI_032024.png",
                "title": "collage of women",
                "detailsLink": "public://images/womancollage2_IWBI_032024.png",
                "imageALT": "collage of women"
              },
              {
                "originalLink": "https://www.3blmedia.com/sites/default/files/styles/fmr_page_photos_blog/public/images/womencollage3_IWBI_032024.png",
                "thumbnailLink": "https://www.3blmedia.com/sites/default/files/styles/thumbnail/public/images/womencollage3_IWBI_032024.png",
                "mediumLink": "https://www.3blmedia.com/sites/default/files/styles/medium/public/images/womencollage3_IWBI_032024.png",
                "title": "collage of women",
                "detailsLink": "public://images/womencollage3_IWBI_032024.png",
                "imageALT": "collage of women"
              }
            ],
            "video": [],
            "audio": [],
            "document": []
          },
          "blogUrl": {
            "link": null,
            "title": null
          },
          "templateType": "classic",
          "imageUrl": "https://www.3blmedia.com/sites/default/files/styles/fmr_page_photos_mm_medium/public/images/womencollage_IWBI_032024.png",
          "displayTwitter": "none"
        }
      },
      {
        "fmr_id": "1253581",
        "published_date": "2024-03-20T17:20:00",
        "company_nid": "348",
        "mediatype": "blog",
        "fmr_list": {
          "companyName": "The Clorox Company",
          "companyLink": "https://www.3blmedia.com/profiles/clorox-company",
          "id": "1253581",
          "title": "Clorox Achieves Zero Waste to Landfill in Saudi Plants",
          "type": "blog",
          "publishedDate": "2024-03-20T17:20:00-04:00",
          "shortTeaser": "Our plants in Dammam and Jeddah in the Kingdom of Saudi Arabia have joined the more than 30 Clorox facilities around the world in achieving zero-waste-to-landfill, or ZWtL, status.",
          "description": "<p>Our plants in Dammam and Jeddah in the Kingdom of Saudi Arabia have joined the more than 30 Clorox facilities around the world in achieving zero-waste-to-landfill, or ZWtL, status.</p><p>As we celebrate Global Recycling Day, we're reminded of the crucial role that recycling and waste management play in our overarching environmental strategy. By responsibly managing our waste streams and minimizing the amount of material sent to landfills, we're not only conserving valuable resources but also mitigating the harmful effects of pollution and greenhouse gas emissions.</p><p>That's why we set an ambitious goal to achieve ZWtL in 100% of our plants by 2025 and in our global facilities by 2030. These most recent achievements mean that all our plants across Asia and the Middle East have officially achieved <a href=\"https://www.thecloroxcompany.com/responsibility/clean-world/reducing-plastic-and-other-waste/\" target=\"_blank\" rel=\"noreferrer noopener\">Clorox's ZWtL criteria</a> a full year before our deadline.</p><p>Critical to our teammates' success has been their focus on upholding housekeeping and waste management processes that meet the specific needs of their operations. Like many sites before them, these teams implemented robust systems for handling waste to ensure that materials are reused or recycled onsite whenever possible.</p><p>The best force-multiplier for achieving zero waste is engaging teammates with awareness campaigns that foster a sense of ownership and responsibility for environmental conservation. Through education and empowerment - including the occasional <a href=\"https://www.thecloroxcompany.com/blog/calling-the-ghostbusters-how-we-kick-started-our-zwtl-journey/\" target=\"_blank\" rel=\"noreferrer noopener\">fun activity </a>- we hope to continue inspiring our workforce to embrace sustainable practices.</p><p>These latest achievements are a testament to the dedication and ingenuity of our teams to set new standards for excellence in environmental management.</p>",
          "linkTo3BL": "https://www.3blmedia.com/",
          "thumbnailLink": "https://www.3blmedia.com/sites/default/files/styles/thumbnail/public/images/1-achieving-zero-waste-landfill_THE-CLOROX-COMPANY_031924.jpg",
          "mediumPhotoLink": "https://www.3blmedia.com/sites/default/files/styles/medium/public/images/1-achieving-zero-waste-landfill_THE-CLOROX-COMPANY_031924.jpg",
          "imageALT": "Four containers with labels indicating different types of waste"
        },
        "fmr_details": {
          "resourceLink": null,
          "resourceText": null,
          "subtitle": "",
          "twitter": null,
          "campaignTitle": null,
          "campaignLink": null,
          "contactInformation": null,
          "multimedia": {
            "images": [
              {
                "originalLink": "https://www.3blmedia.com/sites/default/files/styles/fmr_page_photos_blog/public/images/1-achieving-zero-waste-landfill_THE-CLOROX-COMPANY_031924.jpg",
                "thumbnailLink": "https://www.3blmedia.com/sites/default/files/styles/thumbnail/public/images/1-achieving-zero-waste-landfill_THE-CLOROX-COMPANY_031924.jpg",
                "mediumLink": "https://www.3blmedia.com/sites/default/files/styles/medium/public/images/1-achieving-zero-waste-landfill_THE-CLOROX-COMPANY_031924.jpg",
                "title": "People placing things into a plastic bag: Global Recycling Day",
                "detailsLink": "public://images/1-achieving-zero-waste-landfill_THE-CLOROX-COMPANY_031924.jpg",
                "imageALT": "People placing things into a plastic bag: Global Recycling Day"
              },
              {
                "originalLink": "https://www.3blmedia.com/sites/default/files/styles/fmr_page_photos_blog/public/images/2-achieving-zero-waste-landfill_THE-CLOROX-COMPANY_031924.jpg",
                "thumbnailLink": "https://www.3blmedia.com/sites/default/files/styles/thumbnail/public/images/2-achieving-zero-waste-landfill_THE-CLOROX-COMPANY_031924.jpg",
                "mediumLink": "https://www.3blmedia.com/sites/default/files/styles/medium/public/images/2-achieving-zero-waste-landfill_THE-CLOROX-COMPANY_031924.jpg",
                "title": "Path to Zero",
                "detailsLink": "public://images/2-achieving-zero-waste-landfill_THE-CLOROX-COMPANY_031924.jpg",
                "imageALT": "Path to Zero"
              },
              {
                "originalLink": "https://www.3blmedia.com/sites/default/files/styles/fmr_page_photos_blog/public/images/3-achieving-zero-waste-landfill_THE-CLOROX-COMPANY_031924.png",
                "thumbnailLink": "https://www.3blmedia.com/sites/default/files/styles/thumbnail/public/images/3-achieving-zero-waste-landfill_THE-CLOROX-COMPANY_031924.png",
                "mediumLink": "https://www.3blmedia.com/sites/default/files/styles/medium/public/images/3-achieving-zero-waste-landfill_THE-CLOROX-COMPANY_031924.png",
                "title": "Four containers with labels indicating different types of waste",
                "detailsLink": "public://images/3-achieving-zero-waste-landfill_THE-CLOROX-COMPANY_031924.png",
                "imageALT": "Four containers with labels indicating different types of waste"
              }
            ],
            "video": [],
            "audio": [],
            "document": []
          },
          "blogUrl": {
            "link": null,
            "title": null
          },
          "templateType": "classic",
          "imageUrl": "https://www.3blmedia.com/sites/default/files/styles/fmr_page_photos_mm_medium/public/images/1-achieving-zero-waste-landfill_THE-CLOROX-COMPANY_031924.jpg",
          "displayTwitter": "none"
        }
      },
      {
        "fmr_id": "1252931",
        "published_date": "2024-03-20T17:00:00",
        "company_nid": "1981",
        "mediatype": "multimedia",
        "fmr_list": {
          "companyName": "DOW",
          "companyLink": "https://www.3blmedia.com/profiles/dow",
          "id": "1252931",
          "title": "Design Thinking Plastics Part 1",
          "type": "multimedia",
          "publishedDate": "2024-03-20T17:00:00-04:00",
          "shortTeaser": "In Design Thinking Plastics Part 1, Tony Chambers, Founder of TC & Friends and former editor-in-chief of Wallpaper, delves into how design thinking reimagines the role of plastics in our lives, helps drive solutions for its end of life and its future in a circular world.",
          "description": "<p><strong>EPISODE SUMMARY</strong></p><p>What does design thinking plastics for a future of sustainability mean? In Design Thinking Plastics Part 1, Tony Chambers, Founder of TC &amp; Friends and former editor-in-chief of Wallpaper, delves into how design thinking reimagines the role of plastics in our lives, helps drive solutions for its end of life and its future in a circular world.</p><p><strong>EPISODE NOTES</strong></p><p>In part one of Design Thinking Plastics, we explore the history of how designers helped plastic become a core part of modern life. Tony Chambers, Founder of TC &amp; Friends and former editor-in-chief of Wallpaper, delves into how design thinking is reimagining the role of plastics and how designers are pivoting to give a new life to plastics. From the role of producers and their responsibility to hyper-aware consumers and their perception of plastics, Tony explores how design thinking from the very outset of a product's life cycle can help address plastic waste and ensure its future in a circular world.</p><p><strong>Host</strong>: Maithreyi Seetharaman&nbsp;<br><strong>Show Producer</strong>: Lisa Desai&nbsp;<br><strong>Sound Production</strong>: PhiLipp Schweidler, Department of Noise&nbsp;<br><strong>Communications Advisor</strong>: Jonny West-Symes, Teneo&nbsp;<br><strong>Artwork</strong>: Dow Creative Element</p><p><strong>SHOW CONTRIBUTORS</strong></p><p>Tony Chambers</p><p>Maithreyi Seetharaman</p>",
          "linkTo3BL": "https://www.3blmedia.com/",
          "thumbnailLink": "https://www.3blmedia.com/sites/default/files/styles/thumbnail/public/images/design-thinking-plastic_dow_031324.jpg",
          "mediumPhotoLink": "https://www.3blmedia.com/sites/default/files/styles/medium/public/images/design-thinking-plastic_dow_031324.jpg",
          "imageALT": "Design Thinking Plastics Part 1 Episode 12"
        },
        "fmr_details": {
          "resourceLink": null,
          "resourceText": null,
          "subtitle": "",
          "twitter": null,
          "campaignTitle": null,
          "campaignLink": null,
          "contactInformation": null,
          "multimedia": {
            "images": [
              {
                "originalLink": "https://www.3blmedia.com/sites/default/files/styles/fmr_page_photos_blog/public/images/design-thinking-plastic_dow_031324.jpg",
                "thumbnailLink": "https://www.3blmedia.com/sites/default/files/styles/thumbnail/public/images/design-thinking-plastic_dow_031324.jpg",
                "mediumLink": "https://www.3blmedia.com/sites/default/files/styles/medium/public/images/design-thinking-plastic_dow_031324.jpg",
                "title": "Design Thinking Plastics Part 1 Episode 12",
                "detailsLink": "public://images/design-thinking-plastic_dow_031324.jpg",
                "imageALT": "Design Thinking Plastics Part 1 Episode 12"
              }
            ],
            "video": [],
            "audio": [
              {
                "link": "",
                "audioLink": null,
                "description": "Dow design thinking plastic part 1"
              }
            ],
            "document": []
          },
          "blogUrl": {
            "link": null,
            "title": null
          },
          "templateType": "classic",
          "imageUrl": "https://www.3blmedia.com/sites/default/files/styles/fmr_page_photos_mm_medium/public/images/design-thinking-plastic_dow_031324.jpg",
          "displayTwitter": "none"
        }
      },
      {
        "fmr_id": "1253576",
        "published_date": "2024-03-20T17:00:00",
        "company_nid": "519",
        "mediatype": "multimedia",
        "fmr_list": {
          "companyName": "Kimberly-Clark Corporation",
          "companyLink": "https://www.3blmedia.com/profiles/kimberly-clark-corporation",
          "id": "1253576",
          "title": "2024 Clean200™ List Includes Kimberly-Clark",
          "type": "multimedia",
          "publishedDate": "2024-03-20T17:00:00-04:00",
          "shortTeaser": "Once again, Kimberly-Clark was named to the As You Sow and Corporate Knights Carbon Clean200™ list. This is the fifth time that we have made the list.",
          "description": "<p>Once again, Kimberly-Clark was named to the <a href=\"https://www.asyousow.org/\" target=\"_blank\">As You Sow</a> and Corporate Knights <a href=\"https://www.asyousow.org/report-page/2024-clean200-investing-in-a-clean-energy-future\" target=\"_blank\">Carbon Clean200™</a> list. This is the fifth time that we have made the list.</p><p>The Clean200 list ranks the top 200 publicly traded companies worldwide that are leading the way with solutions for a clean energy present and future. The Clean200 utilizes the <a href=\"https://www.corporateknights.com/resources/corporate-knights-sustainable-taxonomy/\" target=\"_blank\">Corporate Knights Sustainable Revenue database</a>, which tracks companies by their 'clean revenues' in U.S. dollars and recognizes companies that are putting sustainability at the heart of their products, services and investments.</p><p>We are honored to be recognized for our commitment to sustainability and must commend our hardworking teams around the world who deliver on our purpose of Better Care for a Better World.</p><p><strong>About Kimberly-Clark</strong><br>Kimberly-Clark and its trusted brands are an indispensable part of life for people in more than 175 countries. Fueled by ingenuity, creativity, and an understanding of people's most essential needs, we create products that help individuals experience more of what's important to them. Our portfolio of brands, including Huggies, Kleenex, Scott, Kotex, Cottonelle, Poise, Depend, Andrex, Pull-Ups, GoodNites, Intimus, Plenitud, Sweety, Softex, Viva and WypAll, hold No. 1 or No. 2 share positions in approximately 70 countries. We use sustainable practices that support a healthy planet, build strong communities, and ensure our business thrives for decades to come. We are proud to be recognized as one of the World's Most Ethical Companies® by Ethisphere for the sixth year in a row. To keep up with the latest news and to learn more about the company's 150-year history of innovation, visit <a href=\"https://www.kimberly-clark.com/en-us/esg\" target=\"_blank\">kimberly-clark.com</a> or follow Kimberly-Clark on <a href=\"https://www.facebook.com/KimberlyClarkCorp\" target=\"_blank\">Facebook</a>, <a href=\"https://www.instagram.com/kccorp/\" target=\"_blank\">Instagram</a> or <a href=\"https://www.linkedin.com/company/kimberly-clark/\" target=\"_blank\">LinkedIn</a>.</p>",
          "linkTo3BL": "https://www.3blmedia.com/",
          "thumbnailLink": "https://www.3blmedia.com/sites/default/files/styles/thumbnail/public/images/turbine_Kimberly-Clark_31924.png",
          "mediumPhotoLink": "https://www.3blmedia.com/sites/default/files/styles/medium/public/images/turbine_Kimberly-Clark_31924.png",
          "imageALT": "Wind turbines. Text reads: \\\"Kimberly-Clark named to the Carbon Clean200 list for the fifth time."
        },
        "fmr_details": {
          "resourceLink": null,
          "resourceText": null,
          "subtitle": "",
          "twitter": null,
          "campaignTitle": "Carbon Footprint",
          "campaignLink": "https://www.3blmedia.com/news/campaign/carbon-footprint",
          "contactInformation": null,
          "multimedia": {
            "images": [
              {
                "originalLink": "https://www.3blmedia.com/sites/default/files/styles/fmr_page_photos_blog/public/images/turbine_Kimberly-Clark_31924.png",
                "thumbnailLink": "https://www.3blmedia.com/sites/default/files/styles/thumbnail/public/images/turbine_Kimberly-Clark_31924.png",
                "mediumLink": "https://www.3blmedia.com/sites/default/files/styles/medium/public/images/turbine_Kimberly-Clark_31924.png",
                "title": "Wind turbines. Text reads: \\\"Kimberly-Clark named to the Carbon Clean200 list for the fifth time.",
                "detailsLink": "public://images/turbine_Kimberly-Clark_31924.png",
                "imageALT": "Wind turbines. Text reads: \\\"Kimberly-Clark named to the Carbon Clean200 list for the fifth time."
              }
            ],
            "video": [],
            "audio": [],
            "document": []
          },
          "blogUrl": {
            "link": null,
            "title": null
          },
          "templateType": "classic",
          "imageUrl": "https://www.3blmedia.com/sites/default/files/styles/fmr_page_photos_mm_medium/public/images/turbine_Kimberly-Clark_31924.png",
          "displayTwitter": "none"
        }
      },
      {
        "fmr_id": "1247661",
        "published_date": "2024-03-20T16:30:00",
        "company_nid": "3041",
        "mediatype": "article",
        "fmr_list": {
          "companyName": "Lenovo",
          "companyLink": "https://www.3blmedia.com/profiles/lenovo",
          "id": "1247661",
          "title": "Edge Technology at Sea Makes Fishing More Sustainable With Grupo PINSA",
          "type": "article",
          "publishedDate": "2024-03-20T16:30:00-04:00",
          "shortTeaser": "When Grupo PINSA began the ambitious task of bringing Edge Computing to their Pesca Azteca fishing fleet, they turned to Lenovo to help tackle the daunting task.",
          "description": "<p>When Grupo PINSA began the ambitious task of bringing Edge Computing to their Pesca Azteca fishing fleet, they turned to Lenovo to help tackle the daunting task.</p><p><strong>A Global Fishery</strong></p><p>Grupo PINSA is one of the biggest players in Latin America's Fishing industry, their fisheries arm Pesca Azteca operates the largest tuna fishing fleet in Latin America. As a vertically integrated business, the group handles every step in the seafood supply chain, catching, processing, and bringing end-products to markets in the Americas, Europe, and Asia. Their 20+ fishing vessels operate at a harvesting capacity of over 75,000 tons annually. But the group wasn't content with just being the biggest, they wanted to pursue their goals of sustainability and efficiency as far as possible.</p><p>\"The objective of Pesca Azteca is to maintain leadership in catches of tuna,\" says Evaristo Villa Michel, Director General of Pesca Azteca, Grupo PINSA. \"And to capture sustainably with high standards of quality, efficiency, and optimal operation.\"</p><p>Achieving the highest standards of efficiency and optimization meant embracing the capabilities of the latest technology. The group wanted new ways to capture and process data from its fleet, which could lead to less waste and safer, more efficient ventures for each vessel.</p><p>\"We wanted to move away from precarious processes such as the spreadsheets that were used,\" says Sergio Alcaráz Pérez, IT Infrastructure Manager at Grupo PINSA. \"So, we looked for a solution, a technological innovation that could work in maritime conditions.\"</p><p>However, those maritime conditions presented unique challenges of their own.</p><p><strong>Edge Servers at Sea</strong></p><p>One of the biggest challenges Grupo PINSA faced in updating its fleet was the distance and time vessels spent at sea and the difficulty that presents when equipping a crew. Whenever a fishing vessel embarks, it is almost impossible to predict the size of the catch they will return with. This left Grupo PINSA reliant on forecasting estimates to plan production and delivery. Discrepancies between anticipated and actual supply could be costly for the business.</p><p>\"We would only know the true size of the catch once the fleet was back in the harbor,\" explains Alcaráz Pérez. \"It's not easy to scale up to accommodate the increased supply at such short notice. The lack of timely, precise information was holding us back. We needed a more real-time view of supply levels, which could allow the group to make informed decisions around production and logistics well in advance.\"</p><p>To accomplish that, Grupo PINSA went to work developing its own custom software application to manage ships and fishing production. But the ocean made implementing that software another challenge.</p><p>Weather conditions at sea are another near-unpredictable factor that placed strain on PINSA's efforts to modernize their data collection. Sea storms and large waves, high sun and ubiquitous salt put strain on every piece of equipment the fishing fleet relies on. The weather not only put strain on the vessels and the crew, but any attempts to implement servers would have to account for that additional wear and tear.</p><p>\"These are critical conditions,\" explains Carlos Mercado, Deputy Director of Corporate IT. \"We must always have communication data and servers working. The truth is, there is no other place where we have so many problems keeping equipment running. Technology is essential for fisheries management, and not just any server can support us.\"</p><p>PINSA needed a server that was powerful, rugged, and small, since space on the fishing vessels was already at a premium. With all these specific and vital requirements, there weren't many options for edge computing that could fit PINSA's needs.</p><p>That's when the group turned to Lenovo.</p><p><strong>The 'Cutting Edge'</strong></p><p>\"PINSA and Pesca Azteca had already decided which software to use,\" says Lenovo Partner Javier Mehia Loera. \"Only the hardware was missing. At that point, Lenovo came up with the perfect solution.\"</p><p>The Lenovo SE350 edge servers fit the groups, needs, and the vessels' small spaces perfectly. The edge server is built with a focus on smart connectivity and business security, but in a compact and rugged form factor that makes them the ideal server for harsh environments.</p><p>SE350 edge servers are also half the width and significantly shorter than traditional servers. This made them ideal for implementation in fishing vessels tight on space and hyperconscious of cargo loads.</p><p>\"Lenovo Edge Servers are tough enough to withstand sea conditions,\" lauds Mercado. \"And they are so easy to implement that we can set up a new vessel in a single day.\"</p><p>Working with a team from Lenovo, Grupo PINSA outfitted an initial group of three boats with the edge devices. It deployed two Lenovo ThinkEdge SE350 servers in a high-availability cluster on each vessel, running Windows Server and Microsoft Hyper-V virtualization. Every thirty minutes, the solution automatically relays the latest information on supply levels to a central server at group headquarters.</p><p><strong>The Future of Fisheries</strong></p><p>Edge Computing has made it possible for Grupo PINSA to embrace a more nuanced way of tracking fleet supplies and fishing catches. For the first time, the group has clear, reliable insight into fuel and food consumption on its vessels, as well as the size of each catch.</p><p>This is helping the group bring all the links of its seafood supply chain into closer alignment and propel the group towards more efficient, precise, and profitable operations.</p><p>\"It's impressive that such a small server helps us improve fishing so much,\" says Mercado. \"We have a much better grasp on all the information that goes into each trip. Having all this information assures you that the next fishing trip is going to be more productive. Information ultimately becomes savings, and the Lenovo Edge server gave us trust in the security of that data.\"</p><p>Grupo PINSA's endeavor into edge computing is only one facet of the group's growing relationship with Lenovo. As a true technology partner, Lenovo supports PINSA across not only the seafood supply chain, but all aspects of the group's business. From Thinkpad X1 Carbon laptops and mobile devices in the hands of its members, to the mission critical ThinkSystem SR850 servers that make up the group's data center, to the new edge-enabled fishing fleet, Lenovo has become integral to the whole of Grupo PINSA's technological infrastructure.</p><p>The recent success of Grupo PINSA's latest engagement with edge computing has only strengthened the groups partnership with Lenovo and has spurred the group to explore further possibilities in the realm of edge computing, and beyond.</p><p>\"We had a vision for making fleet and fishing production more effective,\" says Alcaráz Pérez. \"And Lenovo proved to be the perfect partner to bring it to life. Lenovo has been a great enabler for our business.\"</p><p><a href=\"https://www.lenovo.com/customer-success/\" target=\"_blank\">For more customer success stories, case studies, and videos, click here or visit https://www.lenovo.com/customer-success/</a></p>",
          "linkTo3BL": "https://www.3blmedia.com/",
          "thumbnailLink": "https://www.3blmedia.com/sites/default/files/styles/thumbnail/public/images/grupo-pinsa_lenovo_012924.jpg",
          "mediumPhotoLink": "https://www.3blmedia.com/sites/default/files/styles/medium/public/images/grupo-pinsa_lenovo_012924.jpg",
          "imageALT": "Two people looking at a laptop in an industrial plant."
        },
        "fmr_details": {
          "resourceLink": null,
          "resourceText": null,
          "subtitle": "How Grupo PINSA runs its fishing fleet more efficiently with Lenovo Infrastructure Solutions and Intelligent Devices at the Edge",
          "twitter": null,
          "campaignTitle": null,
          "campaignLink": null,
          "contactInformation": null,
          "multimedia": {
            "images": [
              {
                "originalLink": "https://www.3blmedia.com/sites/default/files/styles/fmr_page_photos_blog/public/images/grupo-pinsa_lenovo_012924.jpg",
                "thumbnailLink": "https://www.3blmedia.com/sites/default/files/styles/thumbnail/public/images/grupo-pinsa_lenovo_012924.jpg",
                "mediumLink": "https://www.3blmedia.com/sites/default/files/styles/medium/public/images/grupo-pinsa_lenovo_012924.jpg",
                "title": "Aerial view of a fishing operation and sun setting in the distance.",
                "detailsLink": "public://images/grupo-pinsa_lenovo_012924.jpg",
                "imageALT": "Aerial view of a fishing operation and sun setting in the distance."
              },
              {
                "originalLink": "https://www.3blmedia.com/sites/default/files/styles/fmr_page_photos_blog/public/images/pesca_lenovo_012924.jpg",
                "thumbnailLink": "https://www.3blmedia.com/sites/default/files/styles/thumbnail/public/images/pesca_lenovo_012924.jpg",
                "mediumLink": "https://www.3blmedia.com/sites/default/files/styles/medium/public/images/pesca_lenovo_012924.jpg",
                "title": "A person working at a laptop, a fishing boat outside their window.",
                "detailsLink": "public://images/pesca_lenovo_012924.jpg",
                "imageALT": "A person working at a laptop, a fishing boat outside their window."
              },
              {
                "originalLink": "https://www.3blmedia.com/sites/default/files/styles/fmr_page_photos_blog/public/images/edgeserver_lenovo_012924.jpg",
                "thumbnailLink": "https://www.3blmedia.com/sites/default/files/styles/thumbnail/public/images/edgeserver_lenovo_012924.jpg",
                "mediumLink": "https://www.3blmedia.com/sites/default/files/styles/medium/public/images/edgeserver_lenovo_012924.jpg",
                "title": "A person looking in to a space with electronics",
                "detailsLink": "public://images/edgeserver_lenovo_012924.jpg",
                "imageALT": "A person looking in to a space with electronics"
              },
              {
                "originalLink": "https://www.3blmedia.com/sites/default/files/styles/fmr_page_photos_blog/public/images/fishery_lenovo_012924.jpg",
                "thumbnailLink": "https://www.3blmedia.com/sites/default/files/styles/thumbnail/public/images/fishery_lenovo_012924.jpg",
                "mediumLink": "https://www.3blmedia.com/sites/default/files/styles/medium/public/images/fishery_lenovo_012924.jpg",
                "title": "Two people looking at a laptop in an industrial plant.",
                "detailsLink": "public://images/fishery_lenovo_012924.jpg",
                "imageALT": "Two people looking at a laptop in an industrial plant."
              }
            ],
            "video": [
              {
                "link": "https://www.3blmedia.com/sites/default/files/2024-01/EdgeatSea - Sustainable Fishing with Grupo PINSA and Lenovo.mp4",
                "thumbnailLink": "https://www.3blmedia.com/sites/default/files/styles/medium/public/2024-01/fishingserver_lenovo_012924.png",
                "title": "",
                "videoImage": "https://www.3blmedia.com/sites/default/files/styles/medium/public/2024-01/fishingserver_lenovo_012924.png",
                "videoUrl": "public://2024-01/EdgeatSea - Sustainable Fishing with Grupo PINSA and Lenovo.mp4",
                "fid": "1300031"
              }
            ],
            "audio": [],
            "document": []
          },
          "blogUrl": {
            "link": null,
            "title": null
          },
          "templateType": "classic",
          "imageUrl": "https://www.3blmedia.com/sites/default/files/styles/fmr_page_photos_mm_medium/public/videos/thumbnails/1300031/EdgeatSea%20-%20Sustainable%20Fishing%20with%20Grupo%20PINSA%20and%20Lenovo.mp4",
          "displayTwitter": "none"
        }
      },
      {
        "fmr_id": "1253316",
        "published_date": "2024-03-20T16:30:00",
        "company_nid": "2921",
        "mediatype": "article",
        "fmr_list": {
          "companyName": "Enbridge",
          "companyLink": "https://www.3blmedia.com/profiles/enbridge",
          "id": "1253316",
          "title": "2024 Enbridge Day: 'North America Has a Critical Role To Play' in Global Energy Transition, Says CEO",
          "type": "article",
          "publishedDate": "2024-03-20T16:30:00-04:00",
          "shortTeaser": "With enviable scale, scope, connectivity and diversity, Enbridge is prepared to play a bigger role in the global energy transition.",
          "description": "<p>With enviable scale, scope, connectivity and diversity, Enbridge is prepared to play a bigger role in the global energy transition.</p><p>On March 6, during our 2024 Enbridge Day investor community conference in New York, <a href=\"https://www.enbridge.com/media-center/news/details?id=123806&amp;lang=en\" target=\"_blank\" rel=\"noopener noreferrer\">we announced a suite of accretive new capital investments focused on our U.S. Gulf Coast strategy</a>.</p><p>By supplying abundant, cost-competitive and sustainable conventional and lower-carbon energy sources, we're delivering the energy people need while also supporting local communities and helping nations meet global emission targets.</p><p>\"Global demand for affordable, reliable and sustainable energy continues to rise-and North America has a critical role to play,\" noted Greg Ebel, Enbridge's President and CEO.</p><p>\"At Enbridge, we're building out our integrated infrastructure super systems to enable the continued delivery of energy in a planet-friendly way, everywhere people need it.\"</p><p>The March 6th USGC announcements included:</p><ul><li>The acquisition of two marine docks and a parcel of land adjacent to our <a href=\"https://www.enbridge.com/About-Us/Liquids-Pipelines/Export-Terminals\" target=\"_blank\">Enbridge Ingleside Energy Center (EIEC)</a> near Corpus Christi, TX, already the largest oil storage and export terminal by volume in the U.S., from Flint Hills Resources for about US$0.2 billion.</li><li>Forming, with Shell Pipeline, the Oceanus Pipeline Company, LLC to develop offshore gas and oil pipelines serving Shell and Equinor's offshore Sparta development off the Louisiana coast, at a capital cost of about US$0.2 billion.</li><li>A planned expansion of the <a href=\"https://www.enbridge.com/map#map:infrastructure,search=%22gray%20oak%22\" target=\"_blank\" rel=\"noopener noreferrer\">Gray Oak Pipeline</a>, which connects to market centers in the Corpus Christi and Houston regions, of about 120,000 barrels per day, pending a successful open season.</li><li>Sanctioning 2.5 million barrels of additional storage at EIEC, bringing the facility's overall storage capacity to about 20 million barrels by 2025.</li></ul><p>\"These accretive investments provide near-term growth in the U.S. Gulf Coast and set the stage for the future expansion through high-quality partnerships and embedded organic opportunities,\" said Mr. Ebel. \"In combination with today's announcements, our secured growth backlog sits at C$25 billion and is made up of more than 20 highly executable projects.\"</p><p>Today's Enbridge Day activities saw several Enbridge executives take part in the closing bell ceremony at the New York Stock Exchange, where Enbridge stock has been traded since 2001.</p><p>As a first-choice investment vehicle, Enbridge has long prided itself on consistency and predictability, said Mr. Ebel.</p><p>\"Our business model has led to 29 consecutive years of dividend increases, and 18 years of meeting financial guidance. The visibility, duration and low-risk profile of our growth, which underpins our growing dividend, is stronger than ever,\" he said.</p><p>\"Looking forward, we are confident that our growth profile, industry-leading execution and disciplined capital allocation will continue to provide investors with strong total returns and make Enbridge the first-choice investment opportunity.\"</p><p><a href=\"https://www.enbridge.com/Investment-Center/Events-and-Presentations\" target=\"_blank\">See the PPT decks for our various business units from today's 2024 Enbridge Day conference.</a></p>",
          "linkTo3BL": "https://www.3blmedia.com/",
          "thumbnailLink": "https://www.3blmedia.com/sites/default/files/styles/thumbnail/public/images/enbridgeday_enbridge_031524.jpg",
          "mediumPhotoLink": "https://www.3blmedia.com/sites/default/files/styles/medium/public/images/enbridgeday_enbridge_031524.jpg",
          "imageALT": "A long pipe in an industrial plant. Sun barely rising in the corner."
        },
        "fmr_details": {
          "resourceLink": null,
          "resourceText": null,
          "subtitle": "Enbridge announces suite of USGC export investments at annual investor community conference in NYC",
          "twitter": null,
          "campaignTitle": null,
          "campaignLink": null,
          "contactInformation": null,
          "multimedia": {
            "images": [
              {
                "originalLink": "https://www.3blmedia.com/sites/default/files/styles/fmr_page_photos_blog/public/images/enbridgeday_enbridge_031524.jpg",
                "thumbnailLink": "https://www.3blmedia.com/sites/default/files/styles/thumbnail/public/images/enbridgeday_enbridge_031524.jpg",
                "mediumLink": "https://www.3blmedia.com/sites/default/files/styles/medium/public/images/enbridgeday_enbridge_031524.jpg",
                "title": "A long pipe in an industrial plant. Sun barely rising in the corner.",
                "detailsLink": "public://images/enbridgeday_enbridge_031524.jpg",
                "imageALT": "A long pipe in an industrial plant. Sun barely rising in the corner."
              }
            ],
            "video": [],
            "audio": [],
            "document": []
          },
          "blogUrl": {
            "link": null,
            "title": null
          },
          "templateType": "classic",
          "imageUrl": "https://www.3blmedia.com/sites/default/files/styles/fmr_page_photos_mm_medium/public/images/enbridgeday_enbridge_031524.jpg",
          "displayTwitter": "none"
        }
      },
      {
        "fmr_id": "1253661",
        "published_date": "2024-03-20T16:10:00",
        "company_nid": "126",
        "mediatype": "press_release",
        "fmr_list": {
          "companyName": "Ceres",
          "companyLink": "https://www.3blmedia.com/profiles/ceres",
          "id": "1253661",
          "title": "New EPA Vehicle Standards Will Help Ensure the U.S. Leads in the Clean Transportation Future",
          "type": "press_release",
          "publishedDate": "2024-03-20T16:10:00-04:00",
          "shortTeaser": "The final emissions standards for light- and medium-duty vehicles released today by the U.S. Environmental Protection Agency will significantly reduce transportation-related pollution across the country and align federal policy with the priorities of leading businesses.",
          "description": "<p>March 20, 2024 /3BL/ - The final emissions standards for light- and medium-duty vehicles released today by the U.S. Environmental Protection Agency will significantly reduce transportation-related pollution across the country and align federal policy with the priorities of leading businesses and investors that have long supported strong vehicle emission standards.</p><p>The new EPA standards will encourage an accelerated shift to cleaner cars and trucks starting with Model Year 2027 and are projected to result in two-thirds of new U.S. vehicle sales being zero-emission by 2032, delivering significant economic, climate, and public health benefits.</p><blockquote><p>\"We applaud the finalized EPA standards that will help ensure the U.S. is on track to achieve its climate goals. Stronger vehicle emission standards will reduce pollution, save lives and improve air quality across the country, especially in communities located near highways and busy roads, and bring significant economic benefits,\" said <strong>Michael Kodransky, senior director of transportation at Ceres</strong>. \"These standards will position the U.S. to continue attracting investment to build and deploy clean vehicles and infrastructure with good-paying careers in communities across America. Going forward, Ceres is committed to working with the private sector, as well as state and federal policymakers, to accelerate the transition to zero-emission vehicles in the clean transportation future.\"</p></blockquote><blockquote><p>\"As corporate demand for zero-emission vehicle fleets increases across the U.S. economy and throughout supply chains, businesses and investors have emerged as strong supporters of EPA vehicle emissions standards that provide a clear and predictable path to a clean transportation system,\" said <strong>Sara Forni, director of electric vehicles and the Corporate Electric Vehicle Alliance (CEVA) at Ceres</strong>. \"The EPA's new standards will provide that clarity, expand the availability of the electric models that companies need to meet their climate goals, and enable companies to successfully electrify their light- and medium-duty fleets while reducing fuel and maintenance costs.\"</p></blockquote><blockquote><p>\"Tax credits and other strategic investments passed by Congress have sparked a private sector investment boom that is bringing manufacturing, supply chains, and jobs back to communities across the U.S.,\" said <strong>Zach Friedman, director of federal policy, Ceres</strong>. \"Strong vehicle standards provide U.S. businesses the certainty they need to accelerate the momentum toward an advanced and abundant clean energy future, ensure that the cost-saving technologies of growing domestic and global demand are built in the U.S., and benefit U.S. businesses, workers, communities, and consumers. The U.S. must compete and win in the global race to build the clean cars and trucks of today and tomorrow, and these standards are essential to building the necessary policy environment to maximize investment in America.\"</p></blockquote><p>While the standards announced today do not meet the most aggressive timeline of the EPA's original proposal, which Ceres supported, they represent an ambitious and durable advancement that meets the needs of manufacturers, fleet owners, workers, and consumers. The new standards will still dramatically reduce emissions from transportation, the nation's leading source of climate pollution.</p><p>As businesses increasingly seek clean vehicles to reduce pollution and lower fuel and maintenance costs, they have advocated for policies that support these goals, including stronger EPA emissions standards. Last year, more than 60 companies and investors - including<strong> Arapahoe Basin, Avocado Green Brands, Enel North America, Etsy, Friends Fiduciary Corporation, Hackensack Meridian Health, IKEA, Lucid, Lyft, New Belgium Brewing, Nestlé, Sierra Nevada Brewing, Siemens, Snowsports Industries of America, Unilever, and Zevin Asset Management</strong> - signed a letter to the EPA calling for robust standards for light- and medium-duty vehicles, as well as for heavy-duty vehicles. The EPA is expected to soon release its final standards for heavy-duty vehicle emissions as well.</p><p>\"Transportation is <a href=\"https://www.epa.gov/system/files/documents/2023-04/US-GHG-Inventory-2023-Main-Text.pdf\" target=\"_blank\" rel=\"noreferrer noopener\">the largest source</a> of [greenhouse gas] emissions in the U.S. and represents a substantial component of our companies' and portfolios' carbon footprint. By enacting strong vehicle emissions standards that require vehicle manufacturers to produce increasingly efficient and clean vehicles and drive the electrification of the sector, EPA will help ensure the availability of the vehicles needed by companies to cut operating costs, reduce emissions consistent with our climate goals, and support healthy communities for our customers and employees,\" the signatories wrote in the letter organized by Ceres.</p><p>The Corporate Electric Vehicle Alliance, which is led by Ceres and made up of 33 businesses working to increase electric vehicle availability to scale companies' clean fleets, also called on the EPA to pass the strongest possible vehicle emission standards. Businesses and investors have also been essential advocates for state policies to expand zero-emission vehicle sales, like the Advanced Clean Cars and Advanced Clean Trucks rules, and public policy to expand the availability of charging infrastructure across the country.</p><p>Reducing emissions from the transportation sector is critical to the Ceres Ambition 2030 initiative, which aims to decarbonize six of the highest emitting sectors in the U.S.</p><p>About Ceres</p><p>Ceres is a nonprofit organization working with the most influential capital market leaders to solve the world's greatest sustainability challenges. Through our powerful networks and global collaborations of investors, companies, and nonprofits, we drive action and inspire equitable market-based and policy solutions throughout the economy to build a just and sustainable future. For more information, visit ceres.org and follow @CeresNews.</p><p><strong>Media Contact</strong>: Reginald Zimmerman, rzimmerman@ceres.org, 617-247-0700 ext. 136</p>",
          "linkTo3BL": "https://www.3blmedia.com/",
          "thumbnailLink": "",
          "mediumPhotoLink": null,
          "imageALT": ""
        },
        "fmr_details": {
          "resourceLink": null,
          "resourceText": null,
          "subtitle": "",
          "twitter": null,
          "campaignTitle": "Climate Change",
          "campaignLink": "https://www.3blmedia.com/news/campaign/climate-change",
          "contactInformation": null,
          "multimedia": {
            "images": [],
            "video": [],
            "audio": [],
            "document": []
          },
          "blogUrl": {
            "link": null,
            "title": null
          },
          "templateType": "classic",
          "imageUrl": null,
          "displayTwitter": "none"
        }
      },
      {
        "fmr_id": "1253651",
        "published_date": "2024-03-20T16:05:00",
        "company_nid": "997",
        "mediatype": "article",
        "fmr_list": {
          "companyName": "National Grid",
          "companyLink": "https://www.3blmedia.com/profiles/national-grid",
          "id": "1253651",
          "title": "National Grid Announces the Upstate Upgrade; Multi-Year Initiative Will Improve Grid Resilience, Deliver Significant Benefits for Customers, Local Economies",
          "type": "article",
          "publishedDate": "2024-03-20T16:05:00-04:00",
          "shortTeaser": "National Grid plans to invest more than $4 billion to transform its energy delivery system and propel economic growth across Upstate New York.",
          "description": "<p><em>Portfolio of 70+ transmission upgrade projects across Upstate NY will generate thousands of jobs and more than a billion dollars in regional economic growth over next 6 years, while delivering a smarter, stronger, cleaner energy grid for generations to come</em></p><p>National Grid plans to invest more than $4 billion to transform its energy delivery system and propel economic growth across Upstate New York. Called the <a href=\"https://upstateupgrade.nationalgrid.com/\" target=\"_blank\">Upstate Upgrade</a>, the collection of transmission enhancement projects will deliver a smarter, stronger, cleaner energy grid to support a more resilient energy network for generations to come. The company is embarking on <a href=\"https://upstateupgrade.nationalgrid.com/project-hub\" target=\"_blank\">more than 70 projects through 2030</a> that will generate thousands of new jobs and more than a billion dollars in additional economic growth, while ensuring the energy grid is able to meet customers' growing demand for electricity.</p><p>\"The <strong>Upstate Upgrade</strong> represents a landmark investment and speaks to how National Grid is reinforcing the grid to meet our customers' growing energy needs while leading the clean energy transition,\" said Rudy Wynter, National Grid New York President. \"This six-year portfolio of work will transform the grid, improve reliability and resilience and enable us to deliver renewable energy to homes and businesses across New York.\"</p><p>In addition to helping reach the state's climate goals as outlined in New York's Climate Leadership and Community Protection Act, the upgrades will deliver for Upstate New York customers by:</p><p><strong>Improving the Energy Grid's Resilience:</strong> By reinforcing and upgrading infrastructure like transmission lines and substations, the Upstate Upgrade will provide greater resilience in the face of increasingly frequent extreme weather, such as blizzards, tornadoes, and severe windstorms, which are destructive to grid infrastructure. That can mean fewer outages in the future and, when outages do happen, power can be restored quicker. Advanced security measures also will be implemented to safeguard our network from external threats.</p><p><strong>Strengthening the Upstate Economy:</strong> The Upstate Upgrade will benefit local economies by bringing over 1,700 new construction jobs, and associated residual spending to local communities, which in turn will create thousands of additional jobs, and at least $1.9 billion in overall economic output during and after construction, according to a third-party analysis performed by the consultancy West Monroe. The analysis also forecasts the Upstate Upgrade will create up to 2% economic growth in the project areas through 2030.</p><p><strong>Powering Upstate's Energy Future:</strong> As new industry drives growth and revitalizes the region, the Upstate Upgrade will ensure that the electric grid can meet customers' increasing day-to-day demands, including the needs of growing industries, while encouraging more investment and creating new jobs.</p><p>The full scope of the <strong>Upstate Upgrade</strong>, including projects and benefits, can be found at our dedicated website: <a href=\"https://upstateupgrade.nationalgrid.com/\" target=\"_blank\">UpstateUpgrade.NationalGrid.com</a>.</p><p><strong>Julie Tighe, President of New York League of Conservation Voters: </strong>\"There is no transition without transmission. Decarbonizing the state's grid will require more than just generating wind, solar, and hydro power; we also need the poles and wires to deliver all that electricity to our homes and businesses. We applaud National Grid for prioritizing clean energy delivery in New York State.\"</p><p><strong>Rob Simpson, President and CEO of CenterState Corporation for Economic Opportunity: </strong>\"Recent economic development announcements in the Syracuse region and across Upstate demonstrate that the reliability of New York's electric grid and the availability of abundant, clean energy is a competitive advantage, nationally and globally. The Upstate Upgrade will support New York's increasing demand for electricity and encourage further investment and growth with a more efficient and resilient grid. With billions of dollars in new investment, and thousands of jobs generated directly and indirectly from National Grid's efforts, the Upstate Upgrade will help our businesses thrive and communities prosper.\"</p><p><strong>Hui Peng Koh, GlobalFoundries VP and General Manager:</strong> \"We applaud National Grid for sharing in our commitment to innovation, job creation and sustainability. The electricity and semiconductor industries rely on each other, and the Upstate Upgrade will help our region achieve a cutting-edge energy infrastructure to support future growth.\"</p><p><strong>Mark Eagan, President and CEO of the Capital Region Chamber and the Center for Economic Growth:</strong> \"The Upstate Upgrade will transform our electric grid and make additional economic growth possible throughout the state and into the Capital Region. This $4 billion investment over the next six years will spur significant job creation and ensure our communities remain vibrant, prosperous, and growing for years to come. A more resilient, secure, and efficient grid will help drive growth for the Capital Region and all New Yorkers.\"</p><p><strong>Dottie Gallagher, President &amp; CEO at the Buffalo Niagara Partnership:</strong> \"The Buffalo Niagara Partnership welcomes National Grid's comprehensive plan to invest in its electric infrastructure. Affordable, reliable energy is an essential component of economic development and National Grid's investments will help Buffalo Niagara and all of Upstate build a stronger, more competitive, and more equitable economy.\"</p><p><strong>Nicholas Bruno, Vice President Business Development at Mohawk Valley EDGE:</strong> \"We commend National Grid for their ambitious Upstate Upgrade initiative, a testament to their commitment to building a smarter, stronger, and cleaner energy grid for the Mohawk Valley and Upstate New York. These upgrades bolster our local economies by contributing to the Marcy Nanocenter's prospective success, providing opportunities for additional industrial sites, creating new jobs, increasing property taxes, and ultimately contributing to a sustainable future aligned with New York's CLCPA goals. By prioritizing economic development and community engagement, National Grid sets a commendable example of corporate responsibility and partnership that Mohawk Valley EDGE applauds, and we look forward to seeing the results of their efforts.\"</p><p><strong>Garry Douglas, President of the North Country Chamber of Commerce:</strong> \"Ample and reliable power in the North Country has never been more important than it is now with the major transition to electric from other energy sources and with economic development opportunities increasingly needing larger scale power access. That's why National Grid's Upstate Upgrade is so welcome and important. It is a very timely and indisputably crucial investment in sustaining and growing our regional economy in the years ahead and we thank National Grid for this historic commitment.\"</p><p><strong>Anne Boles, Executive Director of the Fulton Montgomery Regional Chamber of Commerce:</strong> \"National Grid's Upstate Upgrade will power the Southern Adirondacks and Mohawk Valley's economic future. These critical upgrades will not only increase the capacity and resiliency of our electric grid, but will bring good-paying jobs, support existing businesses, and help spur new ones. Thanks to these investments, we can look forward to strengthening the region's business climate, economy, and quality of life. It is our mission at the Chamber to support innovation, and to partner in business, workforce, and tourism &amp; economic development.\"</p><p><strong>Patrick J. Kelly, Chief Executive Officer St. Lawrence County Industrial Development Agency:</strong> \"Robust, dependable, and secure electric grid infrastructure is a competitive necessity today and is essential for future economic development success. The Upstate Upgrade being undertaken by National Grid will continue to position central and northern New York State on the leading edge of the transition to renewable and clean energy sources, while reinforcing the foundation of our traditional industrial base.\"</p><p>The <strong>Upstate Upgrade </strong>website includes <a href=\"https://upstateupgrade.nationalgrid.com/community-voices/what-theyre-saying\" target=\"_blank\">more perspectives from local leaders</a>, as well as ways National Grid supports our communities.</p><p><strong>Modernized Grid Will Deliver for Customers, Communities&nbsp;</strong></p><p>National Grid's <strong>Upstate Upgrade</strong> focuses on modernizing the transmission system to meet the expanded electricity needs of the growing economy and to power more electrical devices than ever before, including electric vehicles and heat pumps. And, while the current network has served customers well for more than a century, it wasn't designed to connect and transport the amounts of wind and solar power that will be produced across the region.</p><p>The company will construct or rebuild more than 1,000 miles of transmission line, 45 substations, and install new technologies that prevent load loss, monitor load fluctuations, and resolve congestion. This work also will protect the transmission grid against the increasing threat of extreme weather.</p><p>\"The <strong>Upstate Upgrade</strong> is our largest investment in New York's electricity transmission system since it was built more than 100 years ago.\" Wynter said. \"While the grid has served us well for over a century, it's time to make the changes that will set us up for the next century of growth and success in New York.</p><p>\"In addition, the <strong>Upstate Upgrade </strong>brings with it a different type of energy: economic growth,\" Wynter said. \"It will fuel local economies where our work will be concentrated with new jobs and spending, and expand the property tax base that supports local services, schools and communities.\"</p><p>Economic analysis performed for National Grid by the consulting group West Monroe indicates that the <strong>Upstate Upgrade</strong> could <a href=\"https://upstateupgrade.nationalgrid.com/transforming-upstate-economy\" target=\"_blank\">generate nearly $2 billion in economic output</a> across New York state.</p><p><strong>Economic Benefits of the Upstate Upgrade&nbsp;</strong></p><p>Direct Jobs Created During Construction: More than 1,700</p><p>Total Economic Output: At least $1.9 billion resulting in up to 2% increase in expected growth across the project areas</p><p>Local Sourcing (During Construction): More than $300 million</p><p>\"The <strong>Upstate Upgrade</strong> means thousands of new jobs for the region, not just boosting local businesses, but also increasing property values and the prospects for new storefronts in the region with improved energy infrastructure,\" said Paul DeCotis, a senior partner at West Monroe. \"As an Upstate New York resident, it's a real win-win for community members and business owners with more reliable electric service, opportunities for greater economic expansion, and long-term prosperity in our counties for generations to come.\"</p><p><strong>Consistent, Transparent Information Sharing</strong></p><p>To support this historic grid rebuild, the company has launched a new website <a href=\"https://upstateupgrade.nationalgrid.com/\" target=\"_blank\">UpstateUpgrade.NationalGrid.com</a> - which will serve as a digital hub for details about the projects as they develop, including maps and updates, outreach events and how the <strong>Upstate Upgrade</strong> will benefit every New Yorker.</p><p>\"National Grid is committed to working with and strengthening the communities we serve,\" Wynter said. \"One of the ways we do that is by conducting thoughtful, transparent outreach to residential and business customers, landowners, and elected officials to keep them informed about the<strong> Upstate Upgrade</strong> and offer them the opportunity to provide their thoughts. Our project website is another way we will be facilitating that conversation over the next six years.\"</p><p>National Grid is the largest energy delivery company in Upstate New York, serving electricity to 1.7 million electricity customers across 25,000 square miles.</p><p>-###-</p><p><strong>About National Grid</strong></p><p>National Grid (NYSE: NGG) is an electricity, natural gas, and clean energy delivery company serving more than 20 million people through our networks in New York and Massachusetts. National Grid is focused on building a smarter, stronger, cleaner energy future - transforming our networks with more reliable and resilient energy solutions to meet state climate goals and reduce greenhouse gas emissions.</p><p>For more information, please visit our <a href=\"https://www.nationalgridus.com/\" target=\"_blank\">website</a>, follow us on <a href=\"https://twitter.com/nationalgridus\" target=\"_blank\">X</a>, watch us on <a href=\"https://www.youtube.com/user/NationalGrid\" target=\"_blank\">YouTube</a>, like us on <a href=\"https://www.facebook.com/nationalgrid/?ref=nf\" target=\"_blank\">Facebook</a> and find us on <a href=\"https://www.instagram.com/nationalgrid/?hl=en\" target=\"_blank\">Instagram</a>.</p>",
          "linkTo3BL": "https://www.3blmedia.com/",
          "thumbnailLink": "https://www.3blmedia.com/sites/default/files/styles/thumbnail/public/images/logo_nationalgrid_032024.jpg",
          "mediumPhotoLink": "https://www.3blmedia.com/sites/default/files/styles/medium/public/images/logo_nationalgrid_032024.jpg",
          "imageALT": "National Grid logo"
        },
        "fmr_details": {
          "resourceLink": null,
          "resourceText": null,
          "subtitle": "",
          "twitter": null,
          "campaignTitle": null,
          "campaignLink": null,
          "contactInformation": null,
          "multimedia": {
            "images": [
              {
                "originalLink": "https://www.3blmedia.com/sites/default/files/styles/fmr_page_photos_blog/public/images/logo_nationalgrid_032024.jpg",
                "thumbnailLink": "https://www.3blmedia.com/sites/default/files/styles/thumbnail/public/images/logo_nationalgrid_032024.jpg",
                "mediumLink": "https://www.3blmedia.com/sites/default/files/styles/medium/public/images/logo_nationalgrid_032024.jpg",
                "title": "National Grid logo",
                "detailsLink": "public://images/logo_nationalgrid_032024.jpg",
                "imageALT": "National Grid logo"
              }
            ],
            "video": [],
            "audio": [],
            "document": []
          },
          "blogUrl": {
            "link": null,
            "title": null
          },
          "templateType": "classic",
          "imageUrl": "https://www.3blmedia.com/sites/default/files/styles/fmr_page_photos_mm_medium/public/images/logo_nationalgrid_032024.jpg",
          "displayTwitter": "none"
        }
      },
      {
        "fmr_id": "1253596",
        "published_date": "2024-03-20T16:00:00",
        "company_nid": "967",
        "mediatype": "blog",
        "fmr_list": {
          "companyName": "Ray C. Anderson Foundation",
          "companyLink": "https://www.3blmedia.com/profiles/ray-c-anderson-foundation",
          "id": "1253596",
          "title": "Eco-Action Scales Climate Solutions on Atlanta's West Side",
          "type": "blog",
          "publishedDate": "2024-03-20T16:00:00-04:00",
          "shortTeaser": "ECO-Action, the recipient of a 2024-25 Drawdown Georgia Climate Solutions & Equity Grant, is reducing emissions while improving the quality of life for historically disinvested communities in Georgia.",
          "description": "<p>What do composting, plant-based diets, and home energy efficiency projects have in common?</p><p>They are all climate solutions that can be harnessed to reduce emissions while improving the quality of life for historically disinvested communities in Georgia.</p><p><a href=\"https://eco-act.org/\" target=\"_blank\" rel=\"noopener\">Environmental Community Action (ECO-Action)</a> is putting all of these solutions to work in Georgia communities using funding from a 2024-2025 <a href=\"https://www.drawdownga.org/grants/?page=1&amp;category=58\" target=\"_blank\" rel=\"noopener\">Drawdown Georgia Climate Solutions &amp; Equity Grant</a>.</p><p>ECO-Action exists to promote a safe and healthy environment by helping Georgia communities organize to address environmental health hazards and pollution, particularly in vulnerable, low-income communities and communities of color. Their objective is to empower communities to become more resilient and better able to respond to environmental threats such as global warming, and to improve their environmental, social, and economic health and well-being.</p><p>ECO-Action's grant is funded by a collaborative of Georgia based family foundations including the R. Howard Dobbs, Jr. Foundation (Dobbs Fund), The Ray C. Anderson Foundation, Ghanta Family Foundation, The Reilly Family Fund, The Tull Charitable Foundation and The Wilbur &amp; Hilda Glenn Family Foundation.</p><p><a href=\"https://blog.drawdownga.org/eco-action-scales-climate-solutions-on-atlantas-west-side\" target=\"_blank\">Read the full blog.</a></p>",
          "linkTo3BL": "https://www.3blmedia.com/",
          "thumbnailLink": "https://www.3blmedia.com/sites/default/files/styles/thumbnail/public/images/Eco-Action Youth .jpg",
          "mediumPhotoLink": "https://www.3blmedia.com/sites/default/files/styles/medium/public/images/Eco-Action Youth .jpg",
          "imageALT": "ECO Action Community Class"
        },
        "fmr_details": {
          "resourceLink": null,
          "resourceText": null,
          "subtitle": "A Drawdown Georgia Blog",
          "twitter": null,
          "campaignTitle": "Drawdown Georgia",
          "campaignLink": "https://www.3blmedia.com/news/campaign/drawdown-georgia",
          "contactInformation": null,
          "multimedia": {
            "images": [
              {
                "originalLink": "https://www.3blmedia.com/sites/default/files/styles/fmr_page_photos_blog/public/images/Eco-Action Youth .jpg",
                "thumbnailLink": "https://www.3blmedia.com/sites/default/files/styles/thumbnail/public/images/Eco-Action%20Youth%20.jpg",
                "mediumLink": "https://www.3blmedia.com/sites/default/files/styles/medium/public/images/Eco-Action%20Youth%20.jpg",
                "title": "ECO-Action Youth, Hands On Experiments",
                "detailsLink": "public://images/Eco-Action Youth .jpg",
                "imageALT": "ECO-Action Youth, Hands On Experiments"
              },
              {
                "originalLink": "https://www.3blmedia.com/sites/default/files/styles/fmr_page_photos_blog/public/images/ECO Action Youth Close up young people (1).jpg",
                "thumbnailLink": "https://www.3blmedia.com/sites/default/files/styles/thumbnail/public/images/ECO%20Action%20Youth%20Close%20up%20young%20people%20%281%29.jpg",
                "mediumLink": "https://www.3blmedia.com/sites/default/files/styles/medium/public/images/ECO%20Action%20Youth%20Close%20up%20young%20people%20%281%29.jpg",
                "title": "ECO Action Youth",
                "detailsLink": "public://images/ECO Action Youth Close up young people (1).jpg",
                "imageALT": "ECO Action Youth"
              },
              {
                "originalLink": "https://www.3blmedia.com/sites/default/files/styles/fmr_page_photos_blog/public/images/Eco-Action Community Class_0.jpg",
                "thumbnailLink": "https://www.3blmedia.com/sites/default/files/styles/thumbnail/public/images/Eco-Action%20Community%20Class_0.jpg",
                "mediumLink": "https://www.3blmedia.com/sites/default/files/styles/medium/public/images/Eco-Action%20Community%20Class_0.jpg",
                "title": "ECO Action Community Class",
                "detailsLink": "public://images/Eco-Action Community Class_0.jpg",
                "imageALT": "ECO Action Community Class"
              }
            ],
            "video": [],
            "audio": [],
            "document": []
          },
          "blogUrl": {
            "link": null,
            "title": null
          },
          "templateType": "classic",
          "imageUrl": "https://www.3blmedia.com/sites/default/files/styles/fmr_page_photos_mm_medium/public/images/Eco-Action%20Youth%20.jpg",
          "displayTwitter": "none"
        }
      },
      {
        "fmr_id": "1252661",
        "published_date": "2024-03-20T15:25:00",
        "company_nid": "250",
        "mediatype": "blog",
        "fmr_list": {
          "companyName": "SAP",
          "companyLink": "https://www.3blmedia.com/profiles/sap",
          "id": "1252661",
          "title": "Meeting the New SEC Emissions Policies: We Already Have All the Technology We Need",
          "type": "blog",
          "publishedDate": "2024-03-20T15:25:00-04:00",
          "shortTeaser": "At SAP, we embrace the SEC’s ruling not just as a regulatory measure, but as a promising avenue for companies to thrive by leveraging technology to harness the power of business data.",
          "description": "<p>The U.S. Securities and Exchange Commission (SEC) <a href=\"https://www.sec.gov/news/press-release/2024-31\" target=\"_blank\" rel=\"noreferrer noopener\">announced new rules</a> requiring many large U.S.-listed public companies to disclose climate-related risks that have a material impact on their financials, operations, or business strategy.</p><p>Specifically, companies registered with the SEC now must disclose their Scope 1 and 2 emissions, as in those resulting from both their direct emissions and purchases of electricity and fuel.</p><p><strong>Calculate your carbon footprint from cradle to gate with SAP technology&nbsp;</strong></p><p><a href=\"https://www.sap.com/products/scm/sustainability-footprint-management.html\" target=\"_blank\" rel=\"noreferrer noopener\"><strong>Learn more</strong></a></p><p>Critics of the ruling say it adds to the burden of reporting to multiple government agencies. Others believe the SEC is not going far enough, as its decision does not require the disclosure of Scope 3 emissions, which are generated by a company's suppliers and customers.</p><p>Among the reasons the SEC decided against mandating the disclosure of Scope 3 emissions was the potential difficulty in collecting and measuring this data as well as potential high costs.</p><p>At SAP, we embrace the SEC's ruling not just as a regulatory measure, but as a promising avenue for companies to thrive by leveraging technology to harness the power of business data.</p><p>We are not merely observing from the sidelines; we are actively partnering with our customers to empower them in accurately monitoring emission, reducing energy costs, and streamlining their business processes.</p><p>Our commitment goes beyond compliance - we are dedicated to enabling companies to stay agile in both voluntary and mandatory reporting, recognizing the ever-evolving landscape of emissions disclosure regulations. This sentiment is underscored not only by the recent SEC rule but also by the stringent laws such as the one <a href=\"https://www.gov.ca.gov/wp-content/uploads/2023/10/SB-253-Signing.pdf\" target=\"_blank\" rel=\"noreferrer noopener\">passed last year in California</a> and the EU's <a href=\"https://finance.ec.europa.eu/capital-markets-union-and-financial-markets/company-reporting-and-auditing/company-reporting/corporate-sustainability-reporting_en\" target=\"_blank\" rel=\"noreferrer noopener\">Corporate Sustainability Reporting Directive</a> (CSRD).</p><p>SAP has the technology to make <a href=\"https://news.sap.com/2023/05/record-report-act-sap-sustainability-footprint-management/\" target=\"_blank\">Scope 3 emissions</a> accurate, granular, and stable. We are seeing customers adopt digital technologies that will enable them to comply with all existing and anticipated regulatory requirements around the world up and down their value chains to track emissions accurately, including Scope 3, where applicable.</p><p>From our experience, sustainability management solutions from SAP can benefit businesses while helping them stay compliant with local and global regulations. SAP makes end-to-end carbon management seamless by embedding it into business processes through a cloud-based enterprise resource planning (ERP) system. This offers companies the ability to create a <a href=\"https://www.sap.com/events/sapphire/news-guide/sustainability.html\" target=\"_blank\" rel=\"noreferrer noopener\">green ledger</a> by connecting their financial data with accurate and verifiable emissions data. When this data is connected, they can innovate their operations and supply chains to be more sustainable and competitive.</p><p>The essence of the SEC's impact lies in our unwavering belief in collaboration. Our business-to-business network enables our customers to meet the challenge of disclosing emissions data under various reporting requirements. This ability to accurately track emissions allows companies' stakeholders, including their supply chain partners, to access that information on public websites or mobile apps so they can meet and even exceed the most stringent reporting requirements.</p><p>With SAP's enterprise solutions, companies can operate today while increasing the overall availability and transparency of carbon data. These same solutions also allow for the proactive identification of supply chain partners so companies can further decrease their carbon emissions. Concurrently, government agencies can easily access companies' emissions data using already available enterprise software to improve their emissions reduction goals.</p><p><strong>SAP's Holistic Approach to Cloud-Based Sustainability and Business Transformation</strong></p><p>The reality of our future economy is that it is cloud-based and sustainable. That's why we see our customers transitioning to more agile business models that drive sustainable outcomes.</p><p>SAP guides them through this new reality by providing the technology that allows for their business process shifts across their value chains. Whether they are new local or regional emissions rules, <a href=\"https://news.sap.com/2023/01/sap-responsible-design-and-production-manage-plastic-taxes/\" target=\"_blank\">plastic taxes</a> or <a href=\"https://www.sap.com/products/scm/responsible-design-and-production/what-is-extended-producer-responsibility.html\" target=\"_blank\" rel=\"noreferrer noopener\">extended producer responsibility requirements</a>, SAP is ready to work with customers to minimize any disruptions with these new reporting requirements.</p><p>With a comprehensive and integrated approach to sustainability, SAP solutions move beyond compliance and operationalize sustainability across companies' operations. Customers can build on their ERP solutions over time, transforming business processes for maximum sustainable impact. Companies can also deploy <a href=\"https://www.sap.com/products/artificial-intelligence.html\" target=\"_blank\" rel=\"noreferrer noopener\">SAP Business AI</a> to inform, predict, and optimize sustainable outcomes. These same tools can leverage sustainability regulations and help companies achieve business process transformation.</p><p>We are hopeful that governments will advance carbon accounting globally. Taking that step will harmonize regional and global reporting frameworks and ensure optimal reuse of companies' existing data flows and business processes.</p><p>This SEC decision makes it more important than ever for companies to use digital technologies to track their emissions accurately and not rely on estimated data that often undercounts carbon emissions.</p><p>Regulations can actually <a href=\"https://www.sciencedirect.com/science/article/abs/pii/S1566014121000431#:~:text=These%20researches%20suggest%20that%20formal,and%20Pearson%2C%202007%3B%20Fussler%20and\" target=\"_blank\" rel=\"noreferrer noopener\">drive innovation</a>. We are in a world where businesses must pivot quickly due to externalities like economic shocks, political shifts, and climate-related disasters. SAP has the technology to help companies rapidly adapt to these changes and new regulations.</p>",
          "linkTo3BL": "https://www.3blmedia.com/",
          "thumbnailLink": "https://www.3blmedia.com/sites/default/files/styles/thumbnail/public/images/SECrules_SAP_031224.jpg",
          "mediumPhotoLink": "https://www.3blmedia.com/sites/default/files/styles/medium/public/images/SECrules_SAP_031224.jpg",
          "imageALT": "Aerial view of a body of water with a dam and walkway on top."
        },
        "fmr_details": {
          "resourceLink": null,
          "resourceText": null,
          "subtitle": "Feature by Sophia Mendelsohn",
          "twitter": null,
          "campaignTitle": "SAP | ESG Reporting",
          "campaignLink": "https://www.3blmedia.com/news/campaign/sap-esg-reporting",
          "contactInformation": null,
          "multimedia": {
            "images": [
              {
                "originalLink": "https://www.3blmedia.com/sites/default/files/styles/fmr_page_photos_blog/public/images/SECrules_SAP_031224.jpg",
                "thumbnailLink": "https://www.3blmedia.com/sites/default/files/styles/thumbnail/public/images/SECrules_SAP_031224.jpg",
                "mediumLink": "https://www.3blmedia.com/sites/default/files/styles/medium/public/images/SECrules_SAP_031224.jpg",
                "title": "Aerial view of a body of water with a dam and walkway on top.",
                "detailsLink": "public://images/SECrules_SAP_031224.jpg",
                "imageALT": "Aerial view of a body of water with a dam and walkway on top."
              }
            ],
            "video": [],
            "audio": [],
            "document": []
          },
          "blogUrl": {
            "link": null,
            "title": null
          },
          "templateType": "classic",
          "imageUrl": "https://www.3blmedia.com/sites/default/files/styles/fmr_page_photos_mm_medium/public/images/SECrules_SAP_031224.jpg",
          "displayTwitter": "none"
        }
      },
      {
        "fmr_id": "1250906",
        "published_date": "2024-03-20T15:05:00",
        "company_nid": "255",
        "mediatype": "blog",
        "fmr_list": {
          "companyName": "Quest Diagnostics ",
          "companyLink": "https://www.3blmedia.com/profiles/quest-diagnostics",
          "id": "1250906",
          "title": "My Quest Story - Eddy Hurst",
          "type": "blog",
          "publishedDate": "2024-03-20T15:05:00-04:00",
          "shortTeaser": "Life is good. We’ve all heard this saying used to describe past and current sentiments. It is often said to gauge our emotional, professional, personal, and even financial goals. ",
          "description": "<p>Life is good. We've all heard this saying used to describe past and current sentiments. It is often said to gauge our emotional, professional, personal, and even financial goals. When I decided to leave the retail management sector to use transferable skillsets, I never expected how rewarding it would be. No longer am I working 80 hours a week to execute on every holiday sales event, prepping for inventories for 6 weeks in a 130k-square-foot big box, or worrying about daily sales, shrink, etc.</p><p>Although that was rewarding in many ways, my current role as a Logistics Manager for Quest Diagnostics has a whole different level of rewards. We all know how important our couriers' responsibilities are delivering patients' specimens to our labs for testing, and I've been fortunate to watch it as a first shift and second shift Supervisor before being promoted to Manager. But if you don't know how the Route Service Representative (RSR) performs their role, I'm here to tell you it is a beautiful, choreographed dance every day and night. It is rewarding to watch the RSR be empowered to suggest and make changes that not only benefit Quest, but the client in many ways. They are in control of their route. I've seen RSRs blossom, knowing we put our trust in them to help make the right decision that impacts quality and specimen arrival times to labs, reduces nonproductive stops, and conveys accurate messages so any number of people covering the route can do so successfully. RSRs are actively involved in daily route updates and optimizations. It is their tribal knowledge that helps us achieve the most productivity and efficiencies. I am proud to lead a team toward our shared common goals of Quality, Service, Safety, and Productivity. I appreciate Quest Diagnostics leadership for having trust in me to deliver results and take care of our employees who make it happen every day. Life is good.</p>",
          "linkTo3BL": "https://www.3blmedia.com/",
          "thumbnailLink": "https://www.3blmedia.com/sites/default/files/styles/thumbnail/public/images/Eddy-Hurst_Quest-Diagnostics_022724.jpeg",
          "mediumPhotoLink": "https://www.3blmedia.com/sites/default/files/styles/medium/public/images/Eddy-Hurst_Quest-Diagnostics_022724.jpeg",
          "imageALT": "Eddy Hurst stood next to a white car"
        },
        "fmr_details": {
          "resourceLink": null,
          "resourceText": null,
          "subtitle": "",
          "twitter": null,
          "campaignTitle": null,
          "campaignLink": null,
          "contactInformation": null,
          "multimedia": {
            "images": [
              {
                "originalLink": "https://www.3blmedia.com/sites/default/files/styles/fmr_page_photos_blog/public/images/Eddy-Hurst_Quest-Diagnostics_022724.jpeg",
                "thumbnailLink": "https://www.3blmedia.com/sites/default/files/styles/thumbnail/public/images/Eddy-Hurst_Quest-Diagnostics_022724.jpeg",
                "mediumLink": "https://www.3blmedia.com/sites/default/files/styles/medium/public/images/Eddy-Hurst_Quest-Diagnostics_022724.jpeg",
                "title": "Eddy Hurst stood next to a white car",
                "detailsLink": "public://images/Eddy-Hurst_Quest-Diagnostics_022724.jpeg",
                "imageALT": "Eddy Hurst stood next to a white car"
              }
            ],
            "video": [],
            "audio": [],
            "document": []
          },
          "blogUrl": {
            "link": null,
            "title": null
          },
          "templateType": "classic",
          "imageUrl": "https://www.3blmedia.com/sites/default/files/styles/fmr_page_photos_mm_medium/public/images/Eddy-Hurst_Quest-Diagnostics_022724.jpeg",
          "displayTwitter": "none"
        }
      },
      {
        "fmr_id": "1253571",
        "published_date": "2024-03-20T15:00:00",
        "company_nid": "667",
        "mediatype": "blog",
        "fmr_list": {
          "companyName": "Antea Group",
          "companyLink": "https://www.3blmedia.com/profiles/antea-group",
          "id": "1253571",
          "title": "7 Tips for Choosing a Lab and Testing Your Wastewater",
          "type": "blog",
          "publishedDate": "2024-03-20T15:00:00-04:00",
          "shortTeaser": "Manufacturers of PFAS play a huge role in slowing the release of these substances into the environment. In fact, some facilities are required by law to test for PFAS in their wastewater. But how do you know if you need to test your wastewater?",
          "description": "<p>PFAS, or per- and polyfluoroalkyl substances, are all over the news. Many of us already realize they pose a health risk to humans and the environment. Manufacturers of PFAS play a huge role in slowing the release of these substances into the environment. In fact, some facilities are required by law to test for PFAS in their wastewater.</p><p>While the requirements to test for PFAS in wastewater can vary depending on the jurisdiction and the specific regulations in place, many manufacturers of PFAS, municipal wastewater treatment plants, and facilities with known or suspected PFAS contamination may be required to test influent (incoming) and effluent (outgoing) wastewater for PFAS.</p><p>However, it's important to realize that even if you think your organization will not be asked to sample wastewater for PFAS because you are not a manufacturer of PFAS or your industry is NOT on EPA's priority list, think again. With constantly changing proposed regulations, you should be prepared to sample your wastewater for PFAS.</p><p>So, how do you know if you need to test your wastewater?</p><p><strong>Why Would my Facility Need to Test its Wastewater for PFAS?</strong></p><p>First and foremost, exposure to PFAS-contaminated wastewater can pose risks to the environment and human health. PFAS wastewater discharge can disrupt local ecosystems and degrade water quality around a facility. Communities living near industrial facilities or downstream of wastewater discharge points may be particularly concerned about exposure to PFAS and its potential impacts on their health. In fact, some PFAS compounds have been associated with adverse health effects, including developmental and reproductive toxicity, immune system dysfunction, and certain types of cancer.</p><p>But, that's not all. Regulatory compliance is a huge driver in an organization's decision to test for PFAS. More and more, PFAS has drawn increasing regulatory attention worldwide. Countries and regions have established regulations and guidelines for PFAS in water, soil, air, and consumer products to limit exposure and protect human health and the environment. Companies discharging wastewater containing PFAS may face regulatory scrutiny, compliance requirements, and potential legal consequences.</p><p>In summary, the overarching trend is that testing for PFAS in wastewater will become a more common requirement for organizations. Regardless of why you might need to test your wastewater, finding the right lab for the job is easier said than done. How do you know you're choosing the right lab? What can you do if you suspect your test results aren't accurate? Below, we have some tips to follow for choosing a lab and getting the most accurate results.</p><p><strong>7 Tips for Choosing a Lab and Testing your Wastewater</strong></p><ol><li><strong>Be sure to qualify and approve more than one laboratory through your procurement </strong>- Many labs have a 6 to 16 week turn-around-time for PFAS sample result reports, and some are too busy to take more samples.</li><li><strong>Consider prescreening wastewater for less money</strong> rather than using Method 1633 for $500 plus USD. Either of the two below methods should be considered:<ol><li>Use <a href=\"https://www.epa.gov/system/files/documents/2024-01/method-1621-for-web-posting.pdf\" target=\"_blank\">certified laboratory Method 1621</a> for total adsorbable organofluorine (AOF) as a \"first pass\" to determine whether PFAS may be present above roughly 2 ppb.</li><li>Use a noncertified field test kit for select PFAS compounds to roughly 1 ppb.</li></ol></li><li><strong>Collect both an influent and wastewater effluent sample</strong> - It is not uncommon to observe PFAS in water coming into a facility from the municipality-supplied water.</li><li><strong>Collect quality assurance samples </strong>- Matrix spike and matrix spike duplicates, duplicate samples, and blank samples are great ways to validate and confirm data integrity.</li><li><strong>Consider obtaining results from more than one lab</strong> - Wastewater has a stigma with laboratories. Wastewater with many chemicals can damage laboratory equipment or cause down time due to cleaning. As such, the laboratory may decide to dilute your sample. Due to the dilution process, we have observed erroneously elevated PFAS concentrations compared to laboratories that did not dilute the same sample.</li><li><strong>Consider collecting samples at various times of the day</strong> - PFAS concentrations can fluctuate throughout a 24-hour period.</li><li><strong>Ensure a trained professional collects the sample</strong> - Sample collection should be completed by a trained professional experienced with potential PFAS sources to eliminate doubt in the sample results and prevent potential cross contamination. Avoid any conditions that may add doubt to your sample. Keeping other non-sampling personnel out of the sample collection area can help prevent potential cross contamination.</li></ol><p><strong>What can I do if I suspect my results are inaccurate?</strong></p><p>What happens if you get your results back and they don't seem accurate? Well, we recommend reviewing the testing procedures used to collect and analyze the wastewater samples. Ensure that the procedures followed are consistent with recognized standards and protocols for water quality testing. This may include checking the credentials of the laboratory conducting the analysis (which should have been performed during initial laboratory selection), verifying that they are accredited and certified to perform the required tests, and also talking with the sampler to ensure proper sampling techniques were followed.</p><p>In addition, if you have concerns about the accuracy of the initial results, consider retesting the wastewater samples using a different laboratory or testing method (as long as the samples are within holding time). This can help confirm the accuracy of the results and identify any potential discrepancies between the initial and subsequent tests.</p><p>Finally, Antea Group recommends seeking expert advice. If you are unsure about how to interpret the testing results or address potential inaccuracies, consider seeking advice from experts in water quality testing and analysis who can provide guidance and assistance in interpreting the results and identifying potential sources of error.</p><p><strong>Key Takeaways: Testing Matters</strong></p><p>In conclusion, the increasing focus on PFAS has underscored the importance of wastewater testing for these harmful substances. Regardless of industry or direct involvement in PFAS manufacturing, organizations may find themselves subject to regulatory scrutiny and public concern regarding their wastewater discharge. By prioritizing responsible wastewater management and proactive testing measures, organizations can play a vital role in mitigating the impact of PFAS contamination and foster a safer, healthier environment for all.</p><p>Do you need help with your wastewater testing? We're here to help! <a href=\"https://us.anteagroup.com/services/water-management/wastewater-management\" target=\"_blank\">Contact our Wastewater experts today</a>!</p>",
          "linkTo3BL": "https://www.3blmedia.com/",
          "thumbnailLink": "https://www.3blmedia.com/sites/default/files/styles/thumbnail/public/images/Water Sampling Lab.jpg",
          "mediumPhotoLink": "https://www.3blmedia.com/sites/default/files/styles/medium/public/images/Water Sampling Lab.jpg",
          "imageALT": "water sampling lab"
        },
        "fmr_details": {
          "resourceLink": null,
          "resourceText": null,
          "subtitle": "",
          "twitter": null,
          "campaignTitle": "License to Operate",
          "campaignLink": "https://www.3blmedia.com/news/campaign/license-operate",
          "contactInformation": null,
          "multimedia": {
            "images": [
              {
                "originalLink": "https://www.3blmedia.com/sites/default/files/styles/fmr_page_photos_blog/public/images/Water Sampling Lab.jpg",
                "thumbnailLink": "https://www.3blmedia.com/sites/default/files/styles/thumbnail/public/images/Water%20Sampling%20Lab.jpg",
                "mediumLink": "https://www.3blmedia.com/sites/default/files/styles/medium/public/images/Water%20Sampling%20Lab.jpg",
                "title": "water sampling lab",
                "detailsLink": "public://images/Water Sampling Lab.jpg",
                "imageALT": "water sampling lab"
              }
            ],
            "video": [],
            "audio": [],
            "document": []
          },
          "blogUrl": {
            "link": null,
            "title": null
          },
          "templateType": "classic",
          "imageUrl": "https://www.3blmedia.com/sites/default/files/styles/fmr_page_photos_mm_medium/public/images/Water%20Sampling%20Lab.jpg",
          "displayTwitter": "none"
        }
      },
      {
        "fmr_id": "1253021",
        "published_date": "2024-03-20T14:30:00",
        "company_nid": "1358",
        "mediatype": "article",
        "fmr_list": {
          "companyName": "Rockwell Automation",
          "companyLink": "https://www.3blmedia.com/profiles/rockwell-automation",
          "id": "1253021",
          "title": "Rockwell Automation Named Among World's Most Ethical Companies 2024",
          "type": "article",
          "publishedDate": "2024-03-20T14:30:00-04:00",
          "shortTeaser": "Ethisphere, a global leader in defining and advancing the standards of ethical business practices, has recognized Rockwell Automation, Inc. (NYSE: ROK) as one of the 2024 World’s Most Ethical Companies.",
          "description": "<p><a href=\"https://ethisphere.com/\" target=\"_blank\">Ethisphere</a>, a global leader in defining and advancing the standards of ethical business practices, has recognized Rockwell Automation, Inc. (NYSE: ROK) as one of the <a href=\"https://worldsmostethicalcompanies.com/honorees/\" target=\"_blank\">2024 World's Most Ethical Companies</a>.</p><p>This is the 16<sup>th</sup> time Rockwell has been included on this prestigious list which honors companies that demonstrate exceptional leadership and a commitment to business integrity through best-in-class ethics, compliance, and governance practices.</p><p>\"We are honored to once again receive this recognition from Ethisphere,\" said Rockwell Chairman and CEO Blake Moret. \"Our commitment to ethics and integrity is foundational to our culture, and it's ingrained in everything we do. This commitment is central to our global success and among the reasons we have been a respected business leader for more than 120 years.\"</p><p>Ethics and integrity are among Rockwell's highest scoring drivers of employee engagement, nurtured and cultivated through a robust commitment and a strong \"speak up\" mindset, including the company's long-standing <a href=\"https://www.3blmedia.com/news/rockwell-automations-longstanding-ombuds-reflects-legacy-integrity\" target=\"_blank\">Ombuds program</a>. Rockwell also requires 100% of its Board of Directors, employees, and contractors to complete an Annual Ethics Training, which is updated each year.</p><p>Only 14 companies have achieved this honor 16 or more times, putting Rockwell in a special class of honorees.</p><p>Rockwell was one of 136 honorees recognized in 2024, and only one of two honorees in the Diversified Machinery industry. The ranking spans 20 countries and 44 industries. View the <a href=\"https://worldsmostethicalcompanies.com/honorees/\" target=\"_blank\">full list</a> of 2024 honorees.</p><p>Learn more about Rockwell's commitment to <a href=\"https://www.rockwellautomation.com/en-us/company/about-us/sustainability/ethics-compliance.html\" target=\"_blank\">ethics and integrity</a>.</p>",
          "linkTo3BL": "https://www.3blmedia.com/",
          "thumbnailLink": "https://www.3blmedia.com/sites/default/files/styles/thumbnail/public/images/WMEC_rockwell_031424.png",
          "mediumPhotoLink": "https://www.3blmedia.com/sites/default/files/styles/medium/public/images/WMEC_rockwell_031424.png",
          "imageALT": "\\\" \\\""
        },
        "fmr_details": {
          "resourceLink": null,
          "resourceText": null,
          "subtitle": "",
          "twitter": null,
          "campaignTitle": null,
          "campaignLink": null,
          "contactInformation": null,
          "multimedia": {
            "images": [
              {
                "originalLink": "https://www.3blmedia.com/sites/default/files/styles/fmr_page_photos_blog/public/images/WMEC_rockwell_031424.png",
                "thumbnailLink": "https://www.3blmedia.com/sites/default/files/styles/thumbnail/public/images/WMEC_rockwell_031424.png",
                "mediumLink": "https://www.3blmedia.com/sites/default/files/styles/medium/public/images/WMEC_rockwell_031424.png",
                "title": "\\\" \\\"",
                "detailsLink": "public://images/WMEC_rockwell_031424.png",
                "imageALT": "\\\" \\\""
              }
            ],
            "video": [],
            "audio": [],
            "document": []
          },
          "blogUrl": {
            "link": null,
            "title": null
          },
          "templateType": "classic",
          "imageUrl": "https://www.3blmedia.com/sites/default/files/styles/fmr_page_photos_mm_medium/public/images/WMEC_rockwell_031424.png",
          "displayTwitter": "none"
        }
      },
      {
        "fmr_id": "1253601",
        "published_date": "2024-03-20T14:30:00",
        "company_nid": "531",
        "mediatype": "article",
        "fmr_list": {
          "companyName": "Henkel",
          "companyLink": "https://www.3blmedia.com/profiles/henkel",
          "id": "1253601",
          "title": "Sustainability LIVE: Net Zero - Henkel's CSO Keynote",
          "type": "article",
          "publishedDate": "2024-03-20T14:30:00-04:00",
          "shortTeaser": "Opening Sustainability LIVE: Net Zero – Ulrike Sapiro, Chief Sustainability Officer at Henkel began her keynote with honour and excitement at being the first to speak at the event.",
          "description": "<p><a href=\"https://sustainabilitymag.com/net-zero/sustainability-live-net-zero-henkels-cso-keynote\" target=\"_blank\">Originally published by Georgia Wilson on Sustainability Magazine</a></p><p>Opening Sustainability LIVE: Net Zero - Ulrike Sapiro, Chief Sustainability Officer at Henkel began her keynote with honour and excitement at being the first to speak at the event.</p><p>\"I'm super excited and very honoured to be trusted with kicking off these two very intense content-packed days that we'll have on sustainability - in particular Net zero,\" said Ulrike.</p><p><a href=\"https://sustainabilitymag.com/net-zero/sustainability-live-net-zero-henkels-cso-keynote\" target=\"_blank\">Continue reading here</a></p>",
          "linkTo3BL": "https://www.3blmedia.com/",
          "thumbnailLink": "https://www.3blmedia.com/sites/default/files/styles/thumbnail/public/images/Sustainability-LIVE_Henkel_032024.jpeg",
          "mediumPhotoLink": "https://www.3blmedia.com/sites/default/files/styles/medium/public/images/Sustainability-LIVE_Henkel_032024.jpeg",
          "imageALT": "A person on stage talking into a microphone "
        },
        "fmr_details": {
          "resourceLink": null,
          "resourceText": null,
          "subtitle": "By Georgia Wilson",
          "twitter": null,
          "campaignTitle": null,
          "campaignLink": null,
          "contactInformation": null,
          "multimedia": {
            "images": [
              {
                "originalLink": "https://www.3blmedia.com/sites/default/files/styles/fmr_page_photos_blog/public/images/Sustainability-LIVE_Henkel_032024.jpeg",
                "thumbnailLink": "https://www.3blmedia.com/sites/default/files/styles/thumbnail/public/images/Sustainability-LIVE_Henkel_032024.jpeg",
                "mediumLink": "https://www.3blmedia.com/sites/default/files/styles/medium/public/images/Sustainability-LIVE_Henkel_032024.jpeg",
                "title": "A person on stage in front of an audience ",
                "detailsLink": "public://images/Sustainability-LIVE_Henkel_032024.jpeg",
                "imageALT": "A person on stage in front of an audience "
              },
              {
                "originalLink": "https://www.3blmedia.com/sites/default/files/styles/fmr_page_photos_blog/public/images/Speaker-at-Sustainability-LIVE_Henkel_032024.jpeg",
                "thumbnailLink": "https://www.3blmedia.com/sites/default/files/styles/thumbnail/public/images/Speaker-at-Sustainability-LIVE_Henkel_032024.jpeg",
                "mediumLink": "https://www.3blmedia.com/sites/default/files/styles/medium/public/images/Speaker-at-Sustainability-LIVE_Henkel_032024.jpeg",
                "title": "A person on stage talking into a microphone ",
                "detailsLink": "public://images/Speaker-at-Sustainability-LIVE_Henkel_032024.jpeg",
                "imageALT": "A person on stage talking into a microphone "
              }
            ],
            "video": [
              {
                "link": "https://www.3blmedia.com/sites/default/files/2024-03/Ulrike-Sapiro-on-The-New-Business-Imperative-at-Net-Zero-LIVE-London-2024_Henkel_032024.mp4",
                "thumbnailLink": "https://www.3blmedia.com/sites/default/files/styles/medium/public/2024-03/Ulrike-Sapiro_Henkel_032024.png",
                "title": "",
                "videoImage": "https://www.3blmedia.com/sites/default/files/styles/medium/public/2024-03/Ulrike-Sapiro_Henkel_032024.png",
                "videoUrl": "public://2024-03/Ulrike-Sapiro-on-The-New-Business-Imperative-at-Net-Zero-LIVE-London-2024_Henkel_032024.mp4",
                "fid": "1312491"
              }
            ],
            "audio": [],
            "document": []
          },
          "blogUrl": {
            "link": null,
            "title": null
          },
          "templateType": "classic",
          "imageUrl": "https://www.3blmedia.com/sites/default/files/styles/fmr_page_photos_mm_medium/public/videos/thumbnails/1312491/Ulrike-Sapiro-on-The-New-Business-Imperative-at-Net-Zero-LIVE-London-2024_Henkel_032024.mp4",
          "displayTwitter": "none"
        }
      },
      {
        "fmr_id": "1253531",
        "published_date": "2024-03-20T14:10:00",
        "company_nid": "3086",
        "mediatype": "multimedia",
        "fmr_list": {
          "companyName": "Principal Financial Group",
          "companyLink": "https://www.3blmedia.com/profiles/principal-financial-group",
          "id": "1253531",
          "title": "60 Seconds With Portfolio Manager, Tina Paris",
          "type": "multimedia",
          "publishedDate": "2024-03-20T14:10:00-04:00",
          "shortTeaser": "At Principal®, we invest in what matters. And building talented teams is where it all begins. Take 60 seconds to learn why Tina Paris, a portfolio manager within our asset management area, loves serving her clients and how she’s pursuing her career goals. ",
          "description": "<p>View the video above or watch \"<em>60 Seconds With Portfolio Manager, Tina Paris\"</em> <a href=\"https://www.youtube.com/watch?v=UYZBub4yCng\" target=\"_blank\"><strong>here</strong></a>.</p><p>At Principal®, we invest in what matters. And building talented teams is where it all begins.</p><p>Take 60 seconds to learn why Tina Paris, a portfolio manager within our asset management area, loves serving her clients and how she's pursuing her career goals.</p><p>Explore opportunities to join our team: <a class=\"yt-core-attributed-string__link yt-core-attributed-string__link--display-type yt-core-attributed-string__link--call-to-action-color\" href=\"https://careers.principal.com/careers-home\" target=\"_blank\" rel=\"nofollow\">https://careers.principal.com/careers...</a></p>",
          "linkTo3BL": "https://www.3blmedia.com/",
          "thumbnailLink": "",
          "mediumPhotoLink": null,
          "imageALT": ""
        },
        "fmr_details": {
          "resourceLink": null,
          "resourceText": null,
          "subtitle": "",
          "twitter": null,
          "campaignTitle": "Principal Financial Group: Global Inclusion",
          "campaignLink": "https://www.3blmedia.com/news/campaign/principal-financial-group-global-inclusion",
          "contactInformation": null,
          "multimedia": {
            "images": [],
            "video": [
              {
                "link": "https://www.3blmedia.com/sites/default/files/2024-03/60 seconds with Portfolio Manager, Tina Paris_Principal Financial Group_3.19.24A.mp4",
                "thumbnailLink": "https://www.3blmedia.com/sites/default/files/styles/medium/public/2024-03/60 Seconds_Principal FInancial Group_3.19.24A_4.png",
                "title": "",
                "videoImage": "https://www.3blmedia.com/sites/default/files/styles/medium/public/2024-03/60 Seconds_Principal FInancial Group_3.19.24A_4.png",
                "videoUrl": "public://2024-03/60 seconds with Portfolio Manager, Tina Paris_Principal Financial Group_3.19.24A.mp4",
                "fid": "1312351"
              }
            ],
            "audio": [],
            "document": []
          },
          "blogUrl": {
            "link": null,
            "title": null
          },
          "templateType": "classic",
          "imageUrl": "https://www.3blmedia.com/sites/default/files/styles/fmr_page_photos_mm_medium/public/videos/thumbnails/1312351/60%20seconds%20with%20Portfolio%20Manager%2C%20Tina%20Paris_Principal%20Financial%20Group_3.19.24A.mp4",
          "displayTwitter": "none"
        }
      },
      {
        "fmr_id": "1252136",
        "published_date": "2024-03-20T14:00:00",
        "company_nid": "777",
        "mediatype": "blog",
        "fmr_list": {
          "companyName": "Gen",
          "companyLink": "https://www.3blmedia.com/profiles/gen",
          "id": "1252136",
          "title": "Gen Wins Recognition for Its Commitment to Inclusion",
          "type": "blog",
          "publishedDate": "2024-03-20T14:00:00-04:00",
          "shortTeaser": "Inclusion isn’t just a box to check off. For me, inclusion is a central point of focus every day, and my team continues to work on blending it into everything we do at Gen. Inclusion is (and should always be) woven into our culture.",
          "description": "<p><a href=\"https://www.gendigital.com/blog/impact/life-at-gen/newsweek-inclusion-award-2024\" target=\"_blank\"><strong>Gen Blog |People &amp; Impact</strong></a></p><p>Inclusion isn't just a box to check off. For me, inclusion is a central point of focus every day, and my team continues to work on blending it into everything we do at Gen. Inclusion<em><strong> is</strong></em> (and should always be) woven into our culture. And though we're a global company, it doesn't just come naturally. We still work at it. Strategize around it, purposefully.</p><p>Our four-pillar DEI strategy is at the heart of our mission. These include:</p><ol><li>Measurement and accountability</li><li>Fostering an inclusive environment</li><li>Diversifying our workforce</li><li>Development and retention</li></ol><p>These efforts drive our mission to attract, retain and develop talent by providing meaningful opportunities within our diverse teams. So far, we've found success in more inclusive and diverse teams - success in innovation, creativity and, more importantly, wellness (wellness being physical, emotional and financial).</p><p>Fiscal Year 2023 ended on a good note. But we've still got work to do. <strong>Here is how Gen netted out in FY23:</strong></p><ul><li>30% Of our leadership team are women</li><li>32% Of our global team members are women</li><li>15% Of our team members identified as underrepresented minorities</li><li>6% Of our U.S. team were Black</li></ul><p>I'm glad to say that our efforts haven't gone unnoticed - <strong>Newsweek recently recognized Gen as</strong></p><ul><li>One of <a href=\"https://www.newsweek.com/rankings/americas-greatest-workplaces-women-2024\" target=\"_blank\"><strong>America's Greatest Workplaces for Women</strong></a></li><li>And one of <a href=\"https://www.newsweek.com/rankings/americas-greatest-workplaces-diversity-2024\" target=\"_blank\"><strong>America's Greatest Workplaces for Diversity</strong></a></li></ul><p>That's something we appreciate and celebrate.</p><p>As we continue to grow and build #TeamGen, we'll continue to evolve our representation strategy, too (I look forward to sharing more on that). Below I'll dig into a couple of things happening internally and externally, how we're fostering a culture of belonging and why I think Gen is truly a great workplace.</p><p><strong>Sharing Common Differences: Internal Workings</strong></p><p>Our employee resource groups - which we call \"Communities@Gen\" - help us bring our global team members and allies together for events and initiatives, learning journeys, mentoring, volunteering opportunities and more. It's a way for us to feel close to each other, even when we're far. Share commonalities and differences with people who are like ourselves and those who are eager to learn. It's how we make new friends. Introduce cultural understanding. How we have fun. It's a chance for us to be ourselves (which can be a breath of fresh air in the corporate world).</p><p>Beginning in FY24, each community receives a dedicated budget from our Giving@Gen program to donate to an eligible cause of their choice. Communities also partner with Giving@Gen throughout the year to offer volunteering and giving opportunities for all employees, such as raising funds for organizations like SAATHI, Outhouse, Sapling and many, many more.</p><p><strong>Amplifying Our Impact: External Efforts&nbsp;</strong></p><p>We work with several high-impact nonprofits to accelerate our inclusion work. With our nonprofit partner, Disability:IN, Gen held an all-company event during World Autism Month, highlighting the challenges of sensory overload for neurodiverse individuals and helped people understand how they can better support themselves or team members who may have a disability.</p><p>As part of our efforts to build a pipeline of diverse talent, Gen continues to partner with programs that empower women in tech. <a href=\"https://www.czechitas.cz/en\" target=\"_blank\"><strong>Czechitas</strong></a>, based in the Czech Republic, operates a diverse range of programs to help train and upskill professional women looking to enter tech careers. The nonprofit also helps connect its graduates to partner companies hiring in the IT field. In 2023, our partnership supported eight events, including Czechitas' Digital Academies, educating more than 227 people.</p><p><a href=\"https://women4cyber.eu/\" target=\"_blank\"><strong>Women4Cyber</strong></a> seeks to close the gender gap in cybersecurity through awareness and mentoring programs for women. Our contribution of $150,000 per year for three years will add content to Women4Cyber's Academy, offer mentorships with Gen employees and contribute to the expansion of new chapters.</p><p>We also collaborate with nonprofits to provide Cyber Safety resources to higher-risk and diverse communities. As an example, Gen partners with <a href=\"https://www.thetrevorproject.org/\" target=\"_blank\"><strong>The Trevor Project</strong></a>, the leading suicide prevention and crisis intervention organization for LGBTQ+ young people. Together we created the <a href=\"https://www.thetrevorproject.org/resources/guide/online-safety-for-lgbtq-young-people/\" target=\"_blank\"><strong>Guide to Online Safety for LGBTQ+ Young People</strong></a>. This free digital resource helps queer youth navigate the digital world.</p><p>As a global brand providing safety for the first digital generation, we get how incorporating diverse voices gets us further, faster. And I'm personally excited to lead the charge on the DE&amp;I front and see how Gen continues to grow in the coming years.</p>",
          "linkTo3BL": "https://www.3blmedia.com/",
          "thumbnailLink": "https://www.3blmedia.com/sites/default/files/styles/thumbnail/public/images/1-wins-recognition-commitment-inclusion_GEN_030724.png",
          "mediumPhotoLink": "https://www.3blmedia.com/sites/default/files/styles/medium/public/images/1-wins-recognition-commitment-inclusion_GEN_030724.png",
          "imageALT": "Screenshot of online meeting image"
        },
        "fmr_details": {
          "resourceLink": null,
          "resourceText": null,
          "subtitle": "Making progress on our diversity strategy",
          "twitter": null,
          "campaignTitle": null,
          "campaignLink": null,
          "contactInformation": null,
          "multimedia": {
            "images": [
              {
                "originalLink": "https://www.3blmedia.com/sites/default/files/styles/fmr_page_photos_blog/public/images/1-wins-recognition-commitment-inclusion_GEN_030724.png",
                "thumbnailLink": "https://www.3blmedia.com/sites/default/files/styles/thumbnail/public/images/1-wins-recognition-commitment-inclusion_GEN_030724.png",
                "mediumLink": "https://www.3blmedia.com/sites/default/files/styles/medium/public/images/1-wins-recognition-commitment-inclusion_GEN_030724.png",
                "title": "Two people embracing and smiling",
                "detailsLink": "public://images/1-wins-recognition-commitment-inclusion_GEN_030724.png",
                "imageALT": "Two people embracing and smiling"
              },
              {
                "originalLink": "https://www.3blmedia.com/sites/default/files/styles/fmr_page_photos_blog/public/images/2-wins-recognition-commitment-inclusion_GEN_030724.png",
                "thumbnailLink": "https://www.3blmedia.com/sites/default/files/styles/thumbnail/public/images/2-wins-recognition-commitment-inclusion_GEN_030724.png",
                "mediumLink": "https://www.3blmedia.com/sites/default/files/styles/medium/public/images/2-wins-recognition-commitment-inclusion_GEN_030724.png",
                "title": "1: Measurement and accountability, 2: Fostering an inclusive environment, 3: Diversifying our workforce, 4: Develpment and retention",
                "detailsLink": "public://images/2-wins-recognition-commitment-inclusion_GEN_030724.png",
                "imageALT": "1: Measurement and accountability, 2: Fostering an inclusive environment, 3: Diversifying our workforce, 4: Develpment and retention"
              },
              {
                "originalLink": "https://www.3blmedia.com/sites/default/files/styles/fmr_page_photos_blog/public/images/3-wins-recognition-commitment-inclusion_GEN_030724.png",
                "thumbnailLink": "https://www.3blmedia.com/sites/default/files/styles/thumbnail/public/images/3-wins-recognition-commitment-inclusion_GEN_030724.png",
                "mediumLink": "https://www.3blmedia.com/sites/default/files/styles/medium/public/images/3-wins-recognition-commitment-inclusion_GEN_030724.png",
                "title": "30% Of our leadership team are women, 32% Of our global team members are women, 15% Of our team members identified as underrepresented minorities, 6% Of our U.S. team were Black",
                "detailsLink": "public://images/3-wins-recognition-commitment-inclusion_GEN_030724.png",
                "imageALT": "30% Of our leadership team are women, 32% Of our global team members are women, 15% Of our team members identified as underrepresented minorities, 6% Of our U.S. team were Black"
              },
              {
                "originalLink": "https://www.3blmedia.com/sites/default/files/styles/fmr_page_photos_blog/public/images/4-wins-recognition-commitment-inclusion_GEN_030724.png",
                "thumbnailLink": "https://www.3blmedia.com/sites/default/files/styles/thumbnail/public/images/4-wins-recognition-commitment-inclusion_GEN_030724.png",
                "mediumLink": "https://www.3blmedia.com/sites/default/files/styles/medium/public/images/4-wins-recognition-commitment-inclusion_GEN_030724.png",
                "title": "Screenshot of online meeting image",
                "detailsLink": "public://images/4-wins-recognition-commitment-inclusion_GEN_030724.png",
                "imageALT": "Screenshot of online meeting image"
              }
            ],
            "video": [],
            "audio": [],
            "document": []
          },
          "blogUrl": {
            "link": null,
            "title": null
          },
          "templateType": "classic",
          "imageUrl": "https://www.3blmedia.com/sites/default/files/styles/fmr_page_photos_mm_medium/public/images/1-wins-recognition-commitment-inclusion_GEN_030724.png",
          "displayTwitter": "none"
        }
      },
      {
        "fmr_id": "1253511",
        "published_date": "2024-03-20T14:00:00",
        "company_nid": "960",
        "mediatype": "article",
        "fmr_list": {
          "companyName": "Common Impact",
          "companyLink": "https://www.3blmedia.com/profiles/common-impact",
          "id": "1253511",
          "title": "Authentic Team Building: 4 Tips For Skills-Based Volunteering",
          "type": "article",
          "publishedDate": "2024-03-20T14:00:00-04:00",
          "shortTeaser": "My organization has been creating special volunteering experiences for companies for 20 years, but in all that time, we had never done one of our own. ",
          "description": "<p>My organization has been creating special volunteering experiences for companies for 20 years, but in all that time, we had never done one of our own. We create programs for companies that engage their employees in volunteering for nonprofits using their professional skills, or \"skills-based volunteering.\" In our programs, corporate employees use their skills and expertise to address nonprofits' internal capacity challenges so that they can focus on the important work of delivering their missions.</p><p>We have long touted the benefits of our programs, and when we tried it, we found it was all true. It was fun and rewarding, and we even learned new skills. But one thing surprised us. We had no idea that it would be a powerful team-building exercise.</p><p>It is <a href=\"https://www.newsweek.com/importance-teamwork-workplace-1827448\" target=\"_blank\" rel=\"noreferrer noopener\">well documented</a> that team building improves employee engagement and morale, but many of us cringe when our companies announce a team escape room or virtual Jeopardy. Still, employers know that team building helps employees feel more engaged and connected, and employees appreciate team building, at least in the abstract. Team building needs a reboot, and my team and I have struck on an innovative solution to the teambuilding rut that so many companies are in.</p><p>Skills-based volunteering does not involve painting schools or working in a soup kitchen, though those are valuable. It involves professionals using their skills and expertise in areas like strategy, finance, marketing or human resources to support a nonprofit's organizational challenge, freeing up time so that they can focus on their missions. They are valuable for nonprofits and can be special for volunteers, making them such great team-building experiences. It is rewarding to give back to society; it feels even better when you leverage the skills and expertise you have developed over a lifetime.</p><p>In our skills-based volunteering experience, we worked with America Needs You, an NYC-based nonprofit that serves low-income, first-generation college students; and my team shared that they felt they had worked in unity and purpose with one another during the event. They witnessed their coworkers using skills in ways they had never seen before, and they learned new things about each other, like their lived experiences and personal motivations. They left with a sense of common ground with their coworkers, and that feeling stayed with us after the event.</p><p>We learned a few things that we believe contributed to a successful skills-based volunteering team-building experience. Let's take a look at them.</p><p><strong>Try for live and in-person experiences.</strong></p><p>We held our volunteer team-building exercise during our annual in-person planning retreat. It gave us a welcome break from the intellectual work that we were doing, and the connections we built with each other and with the nonprofits we supported were deeper. Virtual team building is still an option and, in our experience, can be meaningful and impactful, but when possible, in person is best.</p><p><strong>Work with current partners.</strong></p><p>We worked with a nonprofit with which we had a strong relationship. This meant we could dive right into the work together. If you partner with a new nonprofit, consider ways to build trust early, like carving out time for a get-to-know-you or giving them the podium to inspire your team by sharing their passion for their work.</p><p><strong>Curate the experience.</strong></p><p>Intentionally match your employees' skills to the nonprofit's needs. This will require thoughtful pre-work to understand the nonprofit's priorities and challenges, and you will also need a clear understanding of your team's talents. There are two main approaches to skill-matching. You can group employees by skills-e.g., marketing professionals with a nonprofit seeking a brand refresh.</p><p>Another approach is to group people by seniority. We supported first-generation college students on the job hunt. We paired them with both senior and junior members of our team, so while mentoring the fellows, we also developed relationships across our organization.</p><p><strong>Know that there will be challenges.</strong></p><p>Because skills-based volunteering team building needs to be tightly coordinated, it can present some challenges. For one thing, you most likely need dedicated staff or an external organization, like ours, to manage the entire process. Hiccups can arise, too. Sometimes, nonprofits or their staff may drop out at the last minute. People can get sick or have emergencies, and that can't be helped, so you should be prepared to rework your volunteer matches in a pinch.</p><p>Whether a company is ready to consider skills-based volunteering for teambuilding, the principles that drive success can make any teambuilding experience more authentic. Being in person is best when possible. Working with current organizations, partners or vendors can propel success. Dedicating time to closely curating the experience can pay off in a more authentic fit for your team and deeper impact, creating lasting memories.</p><p>On my team, we talked about our skills-based volunteering experience long afterward. To me, that is a sign of team-building success.</p><p>Follow Leila Saad on <a href=\"https://www.linkedin.com/in/leila-saad-504288193/\" target=\"_blank\" rel=\"noreferrer noopener\">LinkedIn</a>.</p><p>For more social impact content, follow Common Impact on <a href=\"https://www.linkedin.com/company/common-impact\" target=\"_blank\" rel=\"noreferrer noopener\">LinkedIn</a> and sign up for our monthly newsletter. Ready to learn more about skills-based volunteering? <a href=\"https://commonimpact.org/contact/corporate-partnerships/\" target=\"_blank\" rel=\"noreferrer noopener\">Contact us</a>.</p><p># # #</p><p><strong>About Common Impact&nbsp;</strong></p><p>Common Impact is a national nonprofit that fosters meaningful partnerships between purpose-driven Fortune 500 companies and nonprofits worldwide to propel social good. Since 2000, Common Impact has generated over 205,000 hours of skills-based volunteering and $40 million in resources. Common Impact is dedicated to helping nonprofits expand their capacity, improve efficiency, and deliver on their mission with customized and impactful projects through corporate partnerships. Learn more about Common Impact's <a href=\"https://commonimpact.org/companies/services-for-companies/\" target=\"_blank\">services</a>, <a href=\"https://commonimpact.org/our-common-impact/\" target=\"_blank\">impact</a>, and <a href=\"https://commonimpact.org/companies/\" target=\"_blank\">clients</a>.</p><p># # #</p><p><strong>Media Contact</strong></p><p>Elizabeth Cross, Obviouslee Marketing&nbsp;<br><a href=\"mailto:common-impact@obviouslee.com\" target=\"_blank\">common-impact@obviouslee.com</a></p>",
          "linkTo3BL": "https://www.3blmedia.com/",
          "thumbnailLink": "https://www.3blmedia.com/sites/default/files/styles/thumbnail/public/images/Newsletter Images (35).png",
          "mediumPhotoLink": "https://www.3blmedia.com/sites/default/files/styles/medium/public/images/Newsletter Images (35).png",
          "imageALT": "Common Impact Logo"
        },
        "fmr_details": {
          "resourceLink": null,
          "resourceText": null,
          "subtitle": "Leila Saad is the CEO of Common Impact, a nonprofit with 20 years of experience creating skills-based volunteering programs.",
          "twitter": null,
          "campaignTitle": "Common Impact Thought Leadership",
          "campaignLink": "https://www.3blmedia.com/news/campaign/common-impact-thought-leadership",
          "contactInformation": null,
          "multimedia": {
            "images": [
              {
                "originalLink": "https://www.3blmedia.com/sites/default/files/styles/fmr_page_photos_blog/public/images/Newsletter Images (35).png",
                "thumbnailLink": "https://www.3blmedia.com/sites/default/files/styles/thumbnail/public/images/Newsletter%20Images%20%2835%29.png",
                "mediumLink": "https://www.3blmedia.com/sites/default/files/styles/medium/public/images/Newsletter%20Images%20%2835%29.png",
                "title": "Volunteers raising their hands. ",
                "detailsLink": "public://images/Newsletter Images (35).png",
                "imageALT": "Volunteers raising their hands. "
              },
              {
                "originalLink": "https://www.3blmedia.com/sites/default/files/styles/fmr_page_photos_blog/public/images/Newsletter Images (36).png",
                "thumbnailLink": "https://www.3blmedia.com/sites/default/files/styles/thumbnail/public/images/Newsletter%20Images%20%2836%29.png",
                "mediumLink": "https://www.3blmedia.com/sites/default/files/styles/medium/public/images/Newsletter%20Images%20%2836%29.png",
                "title": "Forbes Logo ",
                "detailsLink": "public://images/Newsletter Images (36).png",
                "imageALT": "Forbes Logo "
              },
              {
                "originalLink": "https://www.3blmedia.com/sites/default/files/styles/fmr_page_photos_blog/public/images/Newsletter Images (37).png",
                "thumbnailLink": "https://www.3blmedia.com/sites/default/files/styles/thumbnail/public/images/Newsletter%20Images%20%2837%29.png",
                "mediumLink": "https://www.3blmedia.com/sites/default/files/styles/medium/public/images/Newsletter%20Images%20%2837%29.png",
                "title": "Common Impact Logo",
                "detailsLink": "public://images/Newsletter Images (37).png",
                "imageALT": "Common Impact Logo"
              }
            ],
            "video": [],
            "audio": [],
            "document": []
          },
          "blogUrl": {
            "link": null,
            "title": null
          },
          "templateType": "classic",
          "imageUrl": "https://www.3blmedia.com/sites/default/files/styles/fmr_page_photos_mm_medium/public/images/Newsletter%20Images%20%2835%29.png",
          "displayTwitter": "none"
        }
      },
      {
        "fmr_id": "1252846",
        "published_date": "2024-03-20T14:00:00",
        "company_nid": "10151",
        "mediatype": "multimedia",
        "fmr_list": {
          "companyName": "Jazz Pharmaceuticals",
          "companyLink": "https://www.3blmedia.com/profiles/jazz-pharmaceuticals",
          "id": "1252846",
          "title": "Jazz Pharmaceuticals Celebrates International Women's Day",
          "type": "multimedia",
          "publishedDate": "2024-03-20T14:00:00-04:00",
          "shortTeaser": "To mark International Women’s Day, JAWS (Jazz Association of Women Supporters) the affinity forum created to promote the advancement and impact of women globally hosted Jenn Harper, the founder and CEO of Cheekbone Beauty Cosmetics Inc. for a fire side chat.",
          "description": "<p><a href=\"https://www.linkedin.com/posts/jazz-pharmaceuticals_international-womens-day-at-jazz-activity-7173378498097586176-p7xX/?utm_source=share&amp;utm_medium=member_desktop\" target=\"_blank\">Originally published by Jazz Pharmaceuticals</a></p><p>To mark International Women's Day, JAWS (Jazz Association of Women Supporters), the affinity forum created to promote the advancement and impact of women globally in the innovative biotechnology industry, hosted Jenn Harper, the founder and CEO of Cheekbone Beauty Cosmetics for a fireside chat. This inspirational event focused on Ms. Harper's personal journey, her sustainable, socially conscious beauty brand and her mission to support Indigenous youth.&nbsp;</p><p>At Jazz, we are highly committed to creating a work environment where people can be their authentic selves and where we ensure our people practices promote diversity, equity, inclusion and belonging. Jazz efforts to support women are an ongoing commitment and our Corporate Sustainability and Social Impact strategy is aligned with the UN Sustainable Development Goals. Through our aspirational goals and initiatives, we seek to achieve gender parity globally at the Executive Director and above leadership level to foster increased gender representation in leadership roles. Below is a snapshot of our latest activities to demonstrate gender diversity and our support of women in the workforce.</p><ul><li><a href=\"https://investor.jazzpharma.com/news-releases/news-release-details/jazz-pharmaceuticals-announces-key-update-leadership-team\" target=\"_blank\">Renée Galá named President and Chief Operating Officer</a><ul><li><a href=\"https://www.linkedin.com/posts/jazz-pharmaceuticals_iwd2024-inspireinclusion-activity-7171893459442618369-EWEb/\" target=\"_blank\">Inspiring Inclusion Video Message</a></li></ul></li><li><a href=\"https://www.linkedin.com/posts/jazz-pharmaceuticals_were-pleased-to-welcome-liz-henderson-to-activity-7103345759051231232-mnHD/\" target=\"_blank\">Liz Henderson named Sr. Vice President Technical Operations&nbsp;</a></li><li><a href=\"https://www.linkedin.com/feed/update/urn:li:activity:7171912611574308865/\" target=\"_blank\">Jazz Italy Signs Code for Responsible Businesses in Support of Motherhood</a></li><li><a href=\"https://www.pharmavoice.com/news/woman-of-the-week-jazz-pharmaceuticals-neena-patil/649218/\" target=\"_blank\">Neena Patil, Chief Legal Officer featured in PharmaVoice discussing her views on leadership, ESG and healthcare</a></li><li><a href=\"https://www.futureofhr.com/episodes/067-heidi-manna\" target=\"_blank\">Heidi Manna, Chief People Officer speaks to the importance of company culture and JazzRemix</a></li><li><a href=\"https://www.jazzpharma.com/wp-content/uploads/2024/03/2023-Gender-Equality-Index-Report-France-French-and-English-March-2024.pdf\" target=\"_blank\">France Gender Equality Index</a> and <a href=\"https://www.jazzpharma.com/our-purpose/ethical-standards/\" target=\"_blank\">Jazz Pharmaceuticals Ethical Standards</a></li></ul>",
          "linkTo3BL": "https://www.3blmedia.com/",
          "thumbnailLink": "https://www.3blmedia.com/sites/default/files/styles/thumbnail/public/images/IWD_jazzpharmaceuticals_031324.png",
          "mediumPhotoLink": "https://www.3blmedia.com/sites/default/files/styles/medium/public/images/IWD_jazzpharmaceuticals_031324.png",
          "imageALT": "A group of people posed in front of multi-color displays "
        },
        "fmr_details": {
          "resourceLink": null,
          "resourceText": null,
          "subtitle": "",
          "twitter": null,
          "campaignTitle": null,
          "campaignLink": null,
          "contactInformation": null,
          "multimedia": {
            "images": [
              {
                "originalLink": "https://www.3blmedia.com/sites/default/files/styles/fmr_page_photos_blog/public/images/IWD_jazzpharmaceuticals_031324.png",
                "thumbnailLink": "https://www.3blmedia.com/sites/default/files/styles/thumbnail/public/images/IWD_jazzpharmaceuticals_031324.png",
                "mediumLink": "https://www.3blmedia.com/sites/default/files/styles/medium/public/images/IWD_jazzpharmaceuticals_031324.png",
                "title": "Four people posed in front of a wall of colorful fringe. Three holding \\\"IWD\\\" letters.",
                "detailsLink": "public://images/IWD_jazzpharmaceuticals_031324.png",
                "imageALT": "Four people posed in front of a wall of colorful fringe. Three holding \\\"IWD\\\" letters."
              },
              {
                "originalLink": "https://www.3blmedia.com/sites/default/files/styles/fmr_page_photos_blog/public/images/indigenousfaces_jazzpharmaceuticals_031324.png",
                "thumbnailLink": "https://www.3blmedia.com/sites/default/files/styles/thumbnail/public/images/indigenousfaces_jazzpharmaceuticals_031324.png",
                "mediumLink": "https://www.3blmedia.com/sites/default/files/styles/medium/public/images/indigenousfaces_jazzpharmaceuticals_031324.png",
                "title": "A speaker at a podium. A display \\\"Helping the world see indigenous faces\\\" .",
                "detailsLink": "public://images/indigenousfaces_jazzpharmaceuticals_031324.png",
                "imageALT": "A speaker at a podium. A display \\\"Helping the world see indigenous faces\\\" ."
              },
              {
                "originalLink": "https://www.3blmedia.com/sites/default/files/styles/fmr_page_photos_blog/public/images/IWDcelebration_jazzpharmaceuticals_031324.png",
                "thumbnailLink": "https://www.3blmedia.com/sites/default/files/styles/thumbnail/public/images/IWDcelebration_jazzpharmaceuticals_031324.png",
                "mediumLink": "https://www.3blmedia.com/sites/default/files/styles/medium/public/images/IWDcelebration_jazzpharmaceuticals_031324.png",
                "title": "Two people hugging next to a table decorated and IWD letters lit up. Colorful streamers on the ceiling.",
                "detailsLink": "public://images/IWDcelebration_jazzpharmaceuticals_031324.png",
                "imageALT": "Two people hugging next to a table decorated and IWD letters lit up. Colorful streamers on the ceiling."
              },
              {
                "originalLink": "https://www.3blmedia.com/sites/default/files/styles/fmr_page_photos_blog/public/images/IWDparticipants_jazzpharmaceuticals_031324.png",
                "thumbnailLink": "https://www.3blmedia.com/sites/default/files/styles/thumbnail/public/images/IWDparticipants_jazzpharmaceuticals_031324.png",
                "mediumLink": "https://www.3blmedia.com/sites/default/files/styles/medium/public/images/IWDparticipants_jazzpharmaceuticals_031324.png",
                "title": "Two smiling people posed for a selfie.",
                "detailsLink": "public://images/IWDparticipants_jazzpharmaceuticals_031324.png",
                "imageALT": "Two smiling people posed for a selfie."
              },
              {
                "originalLink": "https://www.3blmedia.com/sites/default/files/styles/fmr_page_photos_blog/public/images/inspireinclusion_jazzpharmaceuticals_031324.png",
                "thumbnailLink": "https://www.3blmedia.com/sites/default/files/styles/thumbnail/public/images/inspireinclusion_jazzpharmaceuticals_031324.png",
                "mediumLink": "https://www.3blmedia.com/sites/default/files/styles/medium/public/images/inspireinclusion_jazzpharmaceuticals_031324.png",
                "title": "Papers on a table \\\"I will celebrate women\\'s achievements. #inspireinclusion\\\".",
                "detailsLink": "public://images/inspireinclusion_jazzpharmaceuticals_031324.png",
                "imageALT": "Papers on a table \\\"I will celebrate women\\'s achievements. #inspireinclusion\\\"."
              },
              {
                "originalLink": "https://www.3blmedia.com/sites/default/files/styles/fmr_page_photos_blog/public/images/IWDdayteam_jazzpharmaceuticals_0313124.png",
                "thumbnailLink": "https://www.3blmedia.com/sites/default/files/styles/thumbnail/public/images/IWDdayteam_jazzpharmaceuticals_0313124.png",
                "mediumLink": "https://www.3blmedia.com/sites/default/files/styles/medium/public/images/IWDdayteam_jazzpharmaceuticals_0313124.png",
                "title": "A group of people posed in front of multi-color displays ",
                "detailsLink": "public://images/IWDdayteam_jazzpharmaceuticals_0313124.png",
                "imageALT": "A group of people posed in front of multi-color displays "
              }
            ],
            "video": [],
            "audio": [],
            "document": []
          },
          "blogUrl": {
            "link": null,
            "title": null
          },
          "templateType": "classic",
          "imageUrl": "https://www.3blmedia.com/sites/default/files/styles/fmr_page_photos_mm_medium/public/images/IWD_jazzpharmaceuticals_031324.png",
          "displayTwitter": "none"
        }
      },
      {
        "fmr_id": "1253616",
        "published_date": "2024-03-20T14:00:00",
        "company_nid": "10176",
        "mediatype": "article",
        "fmr_list": {
          "companyName": "Baker Tilly",
          "companyLink": "https://www.3blmedia.com/profiles/baker-tilly",
          "id": "1253616",
          "title": "Baker Tilly Hosts Chicago Urban League & Business Leadership Council for To Boost Collaboration With Women- and Minority-Owned Businesses",
          "type": "article",
          "publishedDate": "2024-03-20T14:00:00-04:00",
          "shortTeaser": "Baker Tilly’s robust Diversity, Equity and Inclusion (DEI) strategy charges teams to integrate DEI across business functions, developing goals that meet the needs of their team members, clients and communities.",
          "description": "<p>Baker Tilly's robust Diversity, Equity and Inclusion (DEI) strategy charges teams to integrate DEI across business functions, developing goals that meet the needs of their team members, clients and communities.</p><p>Recently, an event at Baker Tilly's Chicago offices brought together Baker Tilly professionals with the Chicago Urban League and <a href=\"https://www.blcchicago.com/\" target=\"_blank\">Business Leadership Council</a> to further this inclusive work via a panel discussion and meet and greet. The evening highlighted collaborative opportunities to engage with and support minority business enterprises (MBE) and women businesses enterprises (WBE) across the country.</p><p>\"We were excited to discuss how our work supporting minority and women-owned businesses is an integral part of our firm strategy and goes to our commitment to serving historically under resourced communities by leveraging the power of our people,\" said Assurance Partner Rose Ann Abraham.</p><p>Former Mayor of Gary, Indiana, and CEO of the Chicago Urban League, Karen Freeman Wilson said, \"When I worked with Baker Tilly during my tenure as mayor of Gary, Indiana, I did not have to mandate that they come with a diverse team,\" she said. \"They showed up to a diverse community with a diverse team, and that is what matters to the citizens.\"</p><p><strong>Making connections and facilitating access to capital</strong></p><p>During the panel discussion, Baker Tilly team members shared collaboration success stories and equitable business development efforts.</p><p>Consulting Manager Monique Caston, on Baker Tilly's Public Sector Advisory team, helps forge connections between businesses. \"The Federal government often has requirements that mandate MBE participation so it's important to seek out minority business enterprises that are reflective of the community,\" she said. \"However, it also requires understanding the scope of work and what the technical needs are.\"</p><p>Matt Paschall, Program Manager for DevelUP, Baker Tilly's program that focuses on building an equitable economic development ecosystem that empowers underrepresented stakeholders to thrive, encouraged attendees to register for the Chicago <a href=\"https://www.bakertilly.com/page/develup\" target=\"_blank\">DevelUP conference</a> on April 17 and 18.</p><p>Senior Manager Nick Placek, on Baker Tilly's Development Advisory Services team, said \"What many women and minority subcontractors struggle with is access to capital. Through <a href=\"https://www.bakertilly.com/page/develup\" target=\"_blank\">DevelUP</a> we have helped democratize access to capital for diverse developers and subcontractors.\"</p><p>\"As the focus on DEI continues to be a priority for public, private and non-profit institutions, it is imperative that Baker Tilly continue to lead the way by cultivating an ecosystem of diverse community partnerships, subcontractors, and clients, now, for tomorrow,\" said Jonathan McGee, a senior consultant in Baker Tilly's Development and Community Advisory team.</p><p><a href=\"https://www.bakertilly.com/page/about-us?utm_source=3BL&amp;utm_medium=media+insight&amp;utm_campaign=PR-2024+ULI+Chicago\" target=\"_blank\">Learn more about Baker Tilly</a>.</p>",
          "linkTo3BL": "https://www.3blmedia.com/",
          "thumbnailLink": "https://www.3blmedia.com/sites/default/files/styles/thumbnail/public/images/Large-group_BakerTilly_032024_0.JPG",
          "mediumPhotoLink": "https://www.3blmedia.com/sites/default/files/styles/medium/public/images/Large-group_BakerTilly_032024_0.JPG",
          "imageALT": "People sat at desks"
        },
        "fmr_details": {
          "resourceLink": null,
          "resourceText": null,
          "subtitle": "",
          "twitter": null,
          "campaignTitle": null,
          "campaignLink": null,
          "contactInformation": null,
          "multimedia": {
            "images": [
              {
                "originalLink": "https://www.3blmedia.com/sites/default/files/styles/fmr_page_photos_blog/public/images/Large-group_BakerTilly_032024_0.JPG",
                "thumbnailLink": "https://www.3blmedia.com/sites/default/files/styles/thumbnail/public/images/Large-group_BakerTilly_032024_0.JPG",
                "mediumLink": "https://www.3blmedia.com/sites/default/files/styles/medium/public/images/Large-group_BakerTilly_032024_0.JPG",
                "title": "People sat at desks",
                "detailsLink": "public://images/Large-group_BakerTilly_032024_0.JPG",
                "imageALT": "People sat at desks"
              }
            ],
            "video": [],
            "audio": [],
            "document": []
          },
          "blogUrl": {
            "link": null,
            "title": null
          },
          "templateType": "classic",
          "imageUrl": "https://www.3blmedia.com/sites/default/files/styles/fmr_page_photos_mm_medium/public/images/Large-group_BakerTilly_032024_0.JPG",
          "displayTwitter": "none"
        }
      },
      {
        "fmr_id": "1253621",
        "published_date": "2024-03-20T14:00:00",
        "company_nid": "176",
        "mediatype": "article",
        "fmr_list": {
          "companyName": "The Home Depot",
          "companyLink": "https://www.3blmedia.com/profiles/home-depot",
          "id": "1253621",
          "title": "Before, During and After: Preparing for Severe Weather",
          "type": "article",
          "publishedDate": "2024-03-20T14:00:00-04:00",
          "shortTeaser": "According to the National Oceanic and Atmospheric Administration (NOAA), the United States experienced 28 weather and climate disasters with losses exceeding $1 billion each in 2023. It’s a stark difference to the three separate billion-dollar weather disasters reported in 1980.",
          "description": "<p><a href=\"https://corporate.homedepot.com/news/foundation-and-community/during-and-after-preparing-severe-weather\" target=\"_blank\">Originally published on Built From Scratch</a></p><p>According to the National Oceanic and Atmospheric Administration (NOAA), the United States experienced 28 weather and climate disasters with losses exceeding $1 billion each in 2023. It's a stark difference to the three separate billion-dollar weather disasters reported in 1980.</p><p>With both the frequency and amount of damage done from severe weather and climate events on the rise each year, it's important to have a <a href=\"https://www.weather.gov/safety/\" target=\"_blank\" rel=\"noopener\">plan in place</a>. March is the perfect time to begin preparing because it's often in early spring when tornadoes, hail, high winds and flooding are most prevalent.</p><p>In a typical year, around <a href=\"https://www.nssl.noaa.gov/education/svrwx101/tornadoes/\" target=\"_blank\" rel=\"noopener\">1,200 tornadoes</a> will strike the U.S. Since tornadoes start from thunderstorms and develop quickly, being prepared for a potential strike is critical. There are many things you can do now that will help you get ready and remain safe ahead of tornado season:</p><ul><li>Check your forecast regularly</li><li>Sign up for your community's weather notifications</li><li>Identify a safe room in your home or a nearby safe building</li><li>Create a plan for you and your family and practice</li></ul><p>When a disaster strikes, The Home Depot Foundation stands ready to help. Each year, Team Depot, The Home Depot's associate volunteer force, builds thousands of disaster relief kits ahead of severe weather seasons. By preparing year-round, Team Depot and the Foundation's nonprofit partners can respond immediately to help communities in need.</p><p>Learn more about The Home Depot Foundation's commitment to supporting communities with natural disaster preparedness, short-term response and long-term recovery at <a href=\"http://homedepotfoundation.org/\" target=\"_blank\" rel=\"noopener\">HomeDepotFoundation.org</a>.</p><p>Keep up with all the latest Home Depot news! <a href=\"https://corporate.homedepot.com/node/1444\" target=\"_blank\">Subscribe</a> to our bi-weekly news update and get the top Built from Scratch stories delivered straight to your inbox.</p>",
          "linkTo3BL": "https://www.3blmedia.com/",
          "thumbnailLink": "https://www.3blmedia.com/sites/default/files/styles/thumbnail/public/images/Tornado Season_The Home Depot_3.20.24A.jpg",
          "mediumPhotoLink": "https://www.3blmedia.com/sites/default/files/styles/medium/public/images/Tornado Season_The Home Depot_3.20.24A.jpg",
          "imageALT": "Destruction by a tornado shown. Members of Team Depot shown at the disaster site."
        },
        "fmr_details": {
          "resourceLink": null,
          "resourceText": null,
          "subtitle": "",
          "twitter": null,
          "campaignTitle": "Strengthen Communities",
          "campaignLink": "https://www.3blmedia.com/news/campaign/strengthen-communities",
          "contactInformation": null,
          "multimedia": {
            "images": [
              {
                "originalLink": "https://www.3blmedia.com/sites/default/files/styles/fmr_page_photos_blog/public/images/Tornado Season_The Home Depot_3.20.24A.jpg",
                "thumbnailLink": "https://www.3blmedia.com/sites/default/files/styles/thumbnail/public/images/Tornado%20Season_The%20Home%20Depot_3.20.24A.jpg",
                "mediumLink": "https://www.3blmedia.com/sites/default/files/styles/medium/public/images/Tornado%20Season_The%20Home%20Depot_3.20.24A.jpg",
                "title": "Destruction by a tornado shown. Members of Team Depot shown at the disaster site.",
                "detailsLink": "public://images/Tornado Season_The Home Depot_3.20.24A.jpg",
                "imageALT": "Destruction by a tornado shown. Members of Team Depot shown at the disaster site."
              }
            ],
            "video": [
              {
                "link": "https://www.3blmedia.com/sites/default/files/2024-03/The Home Depot Foundation Disaster Response_The Home Depot_3.20.24B.mp4",
                "thumbnailLink": "https://www.3blmedia.com/sites/default/files/styles/medium/public/2024-03/Tornado Season_The Home Depot_3.20.24C.png",
                "title": "",
                "videoImage": "https://www.3blmedia.com/sites/default/files/styles/medium/public/2024-03/Tornado Season_The Home Depot_3.20.24C.png",
                "videoUrl": "public://2024-03/The Home Depot Foundation Disaster Response_The Home Depot_3.20.24B.mp4",
                "fid": "1312536"
              }
            ],
            "audio": [],
            "document": []
          },
          "blogUrl": {
            "link": null,
            "title": null
          },
          "templateType": "classic",
          "imageUrl": "https://www.3blmedia.com/sites/default/files/styles/fmr_page_photos_mm_medium/public/videos/thumbnails/1312536/The%20Home%20Depot%20Foundation%20Disaster%20Response_The%20Home%20Depot_3.20.24B.mp4",
          "displayTwitter": "none"
        }
      },
      {
        "fmr_id": "1253381",
        "published_date": "2024-03-20T13:30:00",
        "company_nid": "1310",
        "mediatype": "article",
        "fmr_list": {
          "companyName": "3M",
          "companyLink": "https://www.3blmedia.com/profiles/3m",
          "id": "1253381",
          "title": "3M Launches Its 2023 DEI Report",
          "type": "article",
          "publishedDate": "2024-03-20T13:30:00-04:00",
          "shortTeaser": "At 3M, we believe a diverse and inclusive workforce fuels innovation, drives growth, and enriches the communities and markets we serve. And we hold ourselves accountable to meaningful impact within and outside the walls of 3M through our DEI commitments.",
          "description": "<p><a href=\"https://news.3m.com/3M-launches-the-2023-DEI-report\" target=\"_blank\">Originally published on 3M News Center</a></p><p>At 3M, we believe a diverse and inclusive workforce fuels innovation, drives growth, and enriches the communities and markets we serve. And we hold ourselves accountable to meaningful impact within and outside the walls of 3M through our diversity, equity, and inclusion (DEI) commitments.</p><p>To learn about the progress we made in 2023, <a href=\"https://equity.3m.com/DEI-report\" target=\"_blank\">view the DEI report.</a></p><p>We are proud of what our people and partners helped 3M achieve in 2023:</p><ul><li>Advancing total representation of women in the workforce and maintaining 100% gender pay equity in our global regions.</li><li>Continuing to invest in our communities through our commitments to STEM and skilled trade learning experiences and Racial Equity Community investments.</li><li>Progressing our impact in business practices, such as through our first Environmental Justice summit, continued Business Group engagement in equity practices, and social justice advocacy with and through government partners.</li></ul><p>You can find more great stories and details of our progress within the full report.</p>",
          "linkTo3BL": "https://www.3blmedia.com/",
          "thumbnailLink": "https://www.3blmedia.com/sites/default/files/styles/thumbnail/public/images/DEI Report_3M_3.18.24A.jpg",
          "mediumPhotoLink": "https://www.3blmedia.com/sites/default/files/styles/medium/public/images/DEI Report_3M_3.18.24A.jpg",
          "imageALT": "Team members shown reviewing a report."
        },
        "fmr_details": {
          "resourceLink": null,
          "resourceText": null,
          "subtitle": "",
          "twitter": null,
          "campaignTitle": null,
          "campaignLink": null,
          "contactInformation": null,
          "multimedia": {
            "images": [
              {
                "originalLink": "https://www.3blmedia.com/sites/default/files/styles/fmr_page_photos_blog/public/images/DEI Report_3M_3.18.24A.jpg",
                "thumbnailLink": "https://www.3blmedia.com/sites/default/files/styles/thumbnail/public/images/DEI%20Report_3M_3.18.24A.jpg",
                "mediumLink": "https://www.3blmedia.com/sites/default/files/styles/medium/public/images/DEI%20Report_3M_3.18.24A.jpg",
                "title": "Team members shown reviewing a report.",
                "detailsLink": "public://images/DEI Report_3M_3.18.24A.jpg",
                "imageALT": "Team members shown reviewing a report."
              }
            ],
            "video": [],
            "audio": [],
            "document": []
          },
          "blogUrl": {
            "link": null,
            "title": null
          },
          "templateType": "classic",
          "imageUrl": "https://www.3blmedia.com/sites/default/files/styles/fmr_page_photos_mm_medium/public/images/DEI%20Report_3M_3.18.24A.jpg",
          "displayTwitter": "none"
        }
      },
      {
        "fmr_id": "1252851",
        "published_date": "2024-03-20T13:30:00",
        "company_nid": "1951",
        "mediatype": "article",
        "fmr_list": {
          "companyName": "T-Mobile",
          "companyLink": "https://www.3blmedia.com/profiles/t-mobile",
          "id": "1252851",
          "title": "T-Mobile Un-Carrier All-Star Spotlight: Dr. Jie Hui",
          "type": "article",
          "publishedDate": "2024-03-20T13:30:00-04:00",
          "shortTeaser": "Part of a series looking at five T-Mobile women of 5G - tech standouts who are creating a promising future for wireless connectivity.",
          "description": "<p class=\"text-align-center\"><strong>Dr. Jie Hui</strong></p><p class=\"text-align-center\"><strong>Head of Digital Innovation Lab (InLab) at T-Mobile</strong></p><p>Dr. Jie Hui has 20 years of experience in tech innovation, mobile devices, technology product development, infrastructure engineering and big data analytics that have helped T-Mobile generate more than $200 million in business impact. Since joining the Un-carrier 14 years ago, she's secured 39 U.S. patents (and 11 pending!) for her work on innovative technologies and methods, which she proudly displays as part of a patent shrine in her office.</p><p>As one of the company's most innovative leaders, Jie has been on the forefront of T-Mobile's exploration of generative AI.</p><p>Beyond her impressive technical accomplishments, Jie is a fierce advocate for diversity and inclusion in the tech industry. She actively mentors and supports aspiring professionals, especially women, empowering them to break barriers and conquer the world of technology.</p><p>\"I used to be self-conscious that I may be the only female in the room, but now I don't see gender as much as I see peers all seeking the same goal,\" says Jie. \"What I want to teach young engineers and technologists is if you have an idea in your mind that you believe in and are passionate about, then drive toward that goal. People will feel that energy and follow. If you feel shy because you think you're smaller as a woman, people will feel that. You have to do the work internally first and I believe that women supporting women has a lot to do with helping begin that work.\"</p><p>Ultimately, Jie wants to bring magic to people through technological innovations that help make people's lives more enjoyable, richer and fuller.</p>",
          "linkTo3BL": "https://www.3blmedia.com/",
          "thumbnailLink": "",
          "mediumPhotoLink": null,
          "imageALT": ""
        },
        "fmr_details": {
          "resourceLink": null,
          "resourceText": null,
          "subtitle": "Part of a series looking at five T-Mobile women of 5G - tech standouts who are creating a promising future for wireless connectivity.",
          "twitter": null,
          "campaignTitle": null,
          "campaignLink": null,
          "contactInformation": null,
          "multimedia": {
            "images": [],
            "video": [
              {
                "link": "https://www.3blmedia.com/sites/default/files/2024-03/jie v3.mp4",
                "thumbnailLink": "https://www.3blmedia.com/sites/default/files/styles/medium/public/2024-03/drjie_tmobile_031324.png",
                "title": "",
                "videoImage": "https://www.3blmedia.com/sites/default/files/styles/medium/public/2024-03/drjie_tmobile_031324.png",
                "videoUrl": "public://2024-03/jie v3.mp4",
                "fid": "1311061"
              }
            ],
            "audio": [],
            "document": []
          },
          "blogUrl": {
            "link": null,
            "title": null
          },
          "templateType": "classic",
          "imageUrl": "https://www.3blmedia.com/sites/default/files/styles/fmr_page_photos_mm_medium/public/videos/thumbnails/1311061/jie%20v3.mp4",
          "displayTwitter": "none"
        }
      },
      {
        "fmr_id": "1252606",
        "published_date": "2024-03-20T13:30:00",
        "company_nid": "902",
        "mediatype": "multimedia",
        "fmr_list": {
          "companyName": "Kohler Co.",
          "companyLink": "https://www.3blmedia.com/profiles/kohler-co",
          "id": "1252606",
          "title": "Bonnie St. John Inspires at Kohler's International Women's Day Event: Embracing Resilience and Inclusion",
          "type": "multimedia",
          "publishedDate": "2024-03-20T13:30:00-04:00",
          "shortTeaser": "“Everyone falls down. Winners get up. And sometimes, the gold medal winner is just the person who gets up the fastest.” Simple but profound words from the incomparable Bonnie St. John, who we were honored to have with us to celebrate International Womens Day!",
          "description": "<p><a href=\"https://www.linkedin.com/posts/kohler_internationalwomensday-inspireinclusion-altogetherkohler-activity-7171874720248766465-sSYy/\" target=\"_blank\">Originally published on LinkedIn</a></p><p>\"Everyone falls down. Winners get up. And sometimes, the gold medal winner is just the person who gets up the fastest.\"</p><p>Simple but profound words from the incomparable <a href=\"https://www.linkedin.com/in/ACoAAAAQHo0BbxDolOjpq-PAMbZHWibEdtimXgk\" target=\"_blank\">Bonnie St. John</a>, who we were honored to have with us to celebrate International Womens Day!</p><p>In a special event sponsored by our Kohler Women@Work business resource group, the Olympic athlete, Rhodes Scholar, best-selling author, and leadership expert shared her inspiring journey and words of wisdom for taking on the challenges of the modern workplace and world.</p><p>Following Bonnie's powerful keynote address, she participated in a panel discussion with our very own <a href=\"https://www.linkedin.com/in/ACoAAAFOk4cBwDHv0PBt7gaOFnqDe3fMuE-XCxo\" target=\"_blank\">A. J. Hubbard</a>, <a href=\"https://www.linkedin.com/in/ACoAAABKiwIBd2WZapsQhsrEaMGMHupLaORScos\" target=\"_blank\">Laura Ying</a>, <a href=\"https://www.linkedin.com/in/ACoAADK2U_8BOkiXFkRrKrGZ1geXj0wPuSu1HRo\" target=\"_blank\">Dana Morales</a>, <a href=\"https://www.linkedin.com/in/ACoAABAGtToBv3d3ahW0udnLcCSr-cTc8xUMYeA\" target=\"_blank\">Chinomnso Okpara</a>, and <a href=\"https://www.linkedin.com/in/ACoAAACm9WgB7xRvL_1TJlQoV1WawN3wd4RJq6o\" target=\"_blank\">Paul Ryan</a>. Associates tuned in from across the globe to deepen their understanding of how to Inspire Inclusion and gain practical strategies for an improved sense of belonging, relevance, and empowerment.</p>",
          "linkTo3BL": "https://www.3blmedia.com/",
          "thumbnailLink": "https://www.3blmedia.com/sites/default/files/styles/thumbnail/public/images/women-at-work-event_Kohler_031224.jpeg",
          "mediumPhotoLink": "https://www.3blmedia.com/sites/default/files/styles/medium/public/images/women-at-work-event_Kohler_031224.jpeg",
          "imageALT": "A large group of people at an event"
        },
        "fmr_details": {
          "resourceLink": null,
          "resourceText": null,
          "subtitle": "",
          "twitter": null,
          "campaignTitle": null,
          "campaignLink": null,
          "contactInformation": null,
          "multimedia": {
            "images": [
              {
                "originalLink": "https://www.3blmedia.com/sites/default/files/styles/fmr_page_photos_blog/public/images/women-at-work-event_Kohler_031224.jpeg",
                "thumbnailLink": "https://www.3blmedia.com/sites/default/files/styles/thumbnail/public/images/women-at-work-event_Kohler_031224.jpeg",
                "mediumLink": "https://www.3blmedia.com/sites/default/files/styles/medium/public/images/women-at-work-event_Kohler_031224.jpeg",
                "title": "people sat next to each other on chairs ",
                "detailsLink": "public://images/women-at-work-event_Kohler_031224.jpeg",
                "imageALT": "people sat next to each other on chairs "
              },
              {
                "originalLink": "https://www.3blmedia.com/sites/default/files/styles/fmr_page_photos_blog/public/images/2women-at-work-event_Kohler_031224.jpeg",
                "thumbnailLink": "https://www.3blmedia.com/sites/default/files/styles/thumbnail/public/images/2women-at-work-event_Kohler_031224.jpeg",
                "mediumLink": "https://www.3blmedia.com/sites/default/files/styles/medium/public/images/2women-at-work-event_Kohler_031224.jpeg",
                "title": "An audience sat at tables ",
                "detailsLink": "public://images/2women-at-work-event_Kohler_031224.jpeg",
                "imageALT": "An audience sat at tables "
              },
              {
                "originalLink": "https://www.3blmedia.com/sites/default/files/styles/fmr_page_photos_blog/public/images/3women-at-work-event_Kohler_031224.jpeg",
                "thumbnailLink": "https://www.3blmedia.com/sites/default/files/styles/thumbnail/public/images/3women-at-work-event_Kohler_031224.jpeg",
                "mediumLink": "https://www.3blmedia.com/sites/default/files/styles/medium/public/images/3women-at-work-event_Kohler_031224.jpeg",
                "title": "An audience of people watching and listening to a group of speakers ",
                "detailsLink": "public://images/3women-at-work-event_Kohler_031224.jpeg",
                "imageALT": "An audience of people watching and listening to a group of speakers "
              },
              {
                "originalLink": "https://www.3blmedia.com/sites/default/files/styles/fmr_page_photos_blog/public/images/4women-at-work-event_Kohler_031224.jpeg",
                "thumbnailLink": "https://www.3blmedia.com/sites/default/files/styles/thumbnail/public/images/4women-at-work-event_Kohler_031224.jpeg",
                "mediumLink": "https://www.3blmedia.com/sites/default/files/styles/medium/public/images/4women-at-work-event_Kohler_031224.jpeg",
                "title": "A person talking on stage",
                "detailsLink": "public://images/4women-at-work-event_Kohler_031224.jpeg",
                "imageALT": "A person talking on stage"
              },
              {
                "originalLink": "https://www.3blmedia.com/sites/default/files/styles/fmr_page_photos_blog/public/images/5women-at-work-event_Kohler_031224.jpeg",
                "thumbnailLink": "https://www.3blmedia.com/sites/default/files/styles/thumbnail/public/images/5women-at-work-event_Kohler_031224.jpeg",
                "mediumLink": "https://www.3blmedia.com/sites/default/files/styles/medium/public/images/5women-at-work-event_Kohler_031224.jpeg",
                "title": "A group of people stood together for a photo",
                "detailsLink": "public://images/5women-at-work-event_Kohler_031224.jpeg",
                "imageALT": "A group of people stood together for a photo"
              },
              {
                "originalLink": "https://www.3blmedia.com/sites/default/files/styles/fmr_page_photos_blog/public/images/6women-at-work-event_Kohler_031224.jpeg",
                "thumbnailLink": "https://www.3blmedia.com/sites/default/files/styles/thumbnail/public/images/6women-at-work-event_Kohler_031224.jpeg",
                "mediumLink": "https://www.3blmedia.com/sites/default/files/styles/medium/public/images/6women-at-work-event_Kohler_031224.jpeg",
                "title": "A large group of people at an event",
                "detailsLink": "public://images/6women-at-work-event_Kohler_031224.jpeg",
                "imageALT": "A large group of people at an event"
              }
            ],
            "video": [],
            "audio": [],
            "document": []
          },
          "blogUrl": {
            "link": null,
            "title": null
          },
          "templateType": "classic",
          "imageUrl": "https://www.3blmedia.com/sites/default/files/styles/fmr_page_photos_mm_medium/public/images/women-at-work-event_Kohler_031224.jpeg",
          "displayTwitter": "none"
        }
      },
      {
        "fmr_id": "1249156",
        "published_date": "2024-03-20T13:22:00",
        "company_nid": "533",
        "mediatype": "article",
        "fmr_list": {
          "companyName": "Subaru of America, Inc.",
          "companyLink": "https://www.3blmedia.com/profiles/subaru-america-inc",
          "id": "1249156",
          "title": "Could Your Pooch Be a Therapy Dog?",
          "type": "article",
          "publishedDate": "2024-03-20T13:22:00-04:00",
          "shortTeaser": "Together, you and your pup could make a difference in the lives of others.",
          "description": "<p><strong>Together, you and your pup could make a difference in the lives of others.</strong></p><p>Waking my teen daughter, who was struggling with anxiety and desperately trying to avoid going to school, had become a challenge. Back rubs, bright lights and shouting \"good morning\" didn't work, and yelling just created more stress. One day, when I was all out of ideas, in marched our four-legged family member. Penny, a rescued beagle mix, knew exactly what to do.</p><p>Penny could rouse my daughter and get her motivated better than anyone. Using her snout, Penny would burrow under my daughter's arm and then whine and groan and roll around on her back until my teen gave her belly rubs. On the toughest mornings, Penny's fail-safe method was placing her cold, wet nose on my teen's face.</p><p>Once Penny garnered enough attention, she'd hop off the bed leaving my now smiling daughter ready to face the day.  </p><p>According to John Palladino, a director for <a href=\"https://therapaws.org/\" target=\"_blank\">Therapaws of Michigan</a> and certified pet handler, Penny might make an excellent therapy dog. Throughout history, canines have aided their human companions in various roles, and recent studies have <a href=\"https://mydoctor.kaiserpermanente.org/mas/news/the-power-of-pets-how-pets-can-improve-health-and-boost-mood-1969979\" target=\"_blank\">shown their ability to boost people's moods</a>.</p><p>Therapy dogs and their owners volunteer to visit various places, from hospitals to nursing homes to schools and airports. They offer individuals the chance to connect with a friendly dog and take a mental breather.</p><p>\"Therapy dogs are not service dogs,\" <a href=\"https://www.akc.org/sports/title-recognition-program/therapy-dog-program/what-is-a-therapy-dog/\" target=\"_blank\">clarifies the American Kennel Club</a>. \"Service dogs are specially trained to perform specific tasks to help a person with a disability,\" such as guiding someone who is blind. They are also different from a police-trained dog that is given special tasks in detection, patrol or tracking.</p><p>\"Seeing and interacting with dogs helps your brain quickly shift gears from whatever you were ruminating on to being present with the canine,\" says Palladino. As a professor of special education at Eastern Michigan University, Palladino also studies the benefits of pet therapy in the classroom.</p><p>\"The research is very clear on the effectiveness of pet therapy for children with anxiety and depression. In fact, just witnessing another person and dog interact across the room can normalize a person's blood pressure, heart rate, and stress hormones,\" he says.</p><p>Palladino says Therapaws often has more requests for therapy dogs than they can fulfill. So if you're looking for a fun way to bond with your pet and make a positive impact in your community, volunteering to do pet therapy is a great option.</p><p class=\"text-align-center\"><strong>Would Your Pooch Make a Good Therapy Dog?</strong></p><p>Therapy work is open to every kind of dog: purebred, mutt, young or old. Dogs need to be at least 1 year old and physically able to get around (or happy to sit in a stroller).</p><p>\"We're looking at the individual temperament of the dog. They should be stable, calm, able to settle easily and love to be petted,\" says Steve Calcagno, board member and evaluator for <a href=\"https://golden-dogs.org/\" target=\"_blank\">Bright &amp; Beautiful Therapy Dogs</a>.</p><p>The general consensus is that having the right personality for therapy work is crucial. But good manners matter too. Can your dog sit, stay and come when called? Does your dog walk nicely on the leash without pulling and greet people without jumping on them? If not, your pup can still be a therapy dog with a little additional training.  </p><p>An easy way to tell if your dog is ready for testing is to go to a store that allows dogs - oftentimes hardware stores do - or walk your dog downtown. It's a good way to see if your dog enjoys interactions with strangers and can handle startling situations, such as kids running by, in a calm way. But Palladino advises against assessing your dog's responses in a pet store because the scents of other dogs may cause your pet to get defensive or behave differently than he or she might otherwise.</p><p class=\"text-align-center\"><strong>What Are the Training and Certification Requirements?</strong></p><p>Dogs and their handlers (owners) are certified as a team. You can request an evaluation without any official training. It's up to you to decide if you think your dog is ready for the assessment, says Palladino. \"What you do to get ready to pass the evaluation is up to you. Some people take the <a href=\"https://www.akc.org/products-services/training-programs/canine-good-citizen/training-resources/\" target=\"_blank\">American Kennel Club's Canine Good Citizen</a><sup>®</sup> training classes. Others train their dogs themselves or hire a trainer.\"</p><p>The evaluation is typically a multipart assessment to see how well your dog takes direction from you and how your dog responds to strangers, other dogs, and various situations like loud noises. During the assessment, the evaluator may suggest areas to improve upon or let you know if your dog seems like a natural fit for a certain type of pet therapy.</p><p class=\"text-align-center\"><strong>How Do You Start Volunteering?</strong></p><p>Getting started is simple. Contact one of the <a href=\"https://www.akc.org/sports/title-recognition-program/therapy-dog-program/therapy-dog-organizations/\" target=\"_blank\">American Kennel Club's recognized therapy dog organizations</a> near you to learn their requirements for volunteering. They can recommend local training programs and the organization they want you to receive certification from.</p><p>Volunteering is typically a low-key commitment, depending on what you want to do. It can range from participating in occasional special events, such as final exams week at universities, to volunteering regularly once or twice a week. But the impact you make is more than you realize, says Palladino, who has had people schedule their medical appointments around when his dog will be at the hospital. \"When I'm volunteering, people who interact with my dogs always say to me, 'You have no idea how much I needed this.'\"</p><blockquote><p class=\"text-align-center\"><strong>Search-and-Rescue Dogs</strong></p><p>Search-and-rescue dogs also perform an important community service, but the investment of time and money is higher than what is required for a therapy dog. The work is performed strictly on a voluntary basis.</p><p>Fifteen years ago, Casandra Ulbrich, trailing instructor and co-founder of <a href=\"https://www.wssar.net/\" target=\"_blank\">Wolverine State Search and Recovery</a>, never imagined she'd be out searching for missing persons. It was her rambunctious puppy, a German shepherd named Jackson, who started her down the path. Jackson needed an outlet for his energy and intellect beyond the puppy training and agility classes they had already taken.</p><p>\"Someone suggested we try search-and-rescue training, and we both became hooked on it,\" says Ulbrich. \"You develop an amazing bond with your canine - you can read your dog's cues and know what they are sensing or feeling at a level most people will never experience.\"</p><p>Becoming a search-and-rescue team with your dog takes dedication. You have to finance up to two years of weekly training and commit to making yourself available whenever the need arises. \"If it's a live search, let's say a child wandered away from home, you could get a call at 2 o'clock in the morning,\" Ulbrich says. \"The expectation is that you go if you can because you could be the difference between life and death.\"</p><p>Want to learn more? Visit <a href=\"https://sardogsus.org/\" target=\"_blank\">Search and Rescue Dogs of the United States</a>, <a href=\"https://www.n-sda.org/\" target=\"_blank\">National Search Dog Alliance</a> or browse online for local search-and-rescue groups.</p></blockquote><p><strong>ABOUT THE AUTHOR</strong></p><p>Kristi Valentini is a travel writer whose work has been featured in<em> Woman's Day</em>,<em> Good Housekeeping</em>, Oprah Daily and more. She creates easy-to-use trip guides at Readymade Travel Plans for people who love taking a vacation but hate planning for it.</p>",
          "linkTo3BL": "https://www.3blmedia.com/",
          "thumbnailLink": "https://www.3blmedia.com/sites/default/files/styles/thumbnail/public/images/Paws-in-hands_Subaru_020924.jpg",
          "mediumPhotoLink": "https://www.3blmedia.com/sites/default/files/styles/medium/public/images/Paws-in-hands_Subaru_020924.jpg",
          "imageALT": "\\\" \\\""
        },
        "fmr_details": {
          "resourceLink": null,
          "resourceText": null,
          "subtitle": "By Kristi Valentini",
          "twitter": null,
          "campaignTitle": null,
          "campaignLink": null,
          "contactInformation": null,
          "multimedia": {
            "images": [
              {
                "originalLink": "https://www.3blmedia.com/sites/default/files/styles/fmr_page_photos_blog/public/images/Paws-in-hands_Subaru_020924.jpg",
                "thumbnailLink": "https://www.3blmedia.com/sites/default/files/styles/thumbnail/public/images/Paws-in-hands_Subaru_020924.jpg",
                "mediumLink": "https://www.3blmedia.com/sites/default/files/styles/medium/public/images/Paws-in-hands_Subaru_020924.jpg",
                "title": "Dog paws resting in a persons palm",
                "detailsLink": "public://images/Paws-in-hands_Subaru_020924.jpg",
                "imageALT": "Dog paws resting in a persons palm"
              },
              {
                "originalLink": "https://www.3blmedia.com/sites/default/files/styles/fmr_page_photos_blog/public/images/Penny_Subaru_020924.jpg",
                "thumbnailLink": "https://www.3blmedia.com/sites/default/files/styles/thumbnail/public/images/Penny_Subaru_020924.jpg",
                "mediumLink": "https://www.3blmedia.com/sites/default/files/styles/medium/public/images/Penny_Subaru_020924.jpg",
                "title": "\\\" \\\"",
                "detailsLink": "public://images/Penny_Subaru_020924.jpg",
                "imageALT": "\\\" \\\""
              },
              {
                "originalLink": "https://www.3blmedia.com/sites/default/files/styles/fmr_page_photos_blog/public/images/Kevin_Subaru_020924.jpg",
                "thumbnailLink": "https://www.3blmedia.com/sites/default/files/styles/thumbnail/public/images/Kevin_Subaru_020924.jpg",
                "mediumLink": "https://www.3blmedia.com/sites/default/files/styles/medium/public/images/Kevin_Subaru_020924.jpg",
                "title": "\\\" \\\"",
                "detailsLink": "public://images/Kevin_Subaru_020924.jpg",
                "imageALT": "\\\" \\\""
              },
              {
                "originalLink": "https://www.3blmedia.com/sites/default/files/styles/fmr_page_photos_blog/public/images/Kevin-at-the-airport_Subaru_020924.jpg",
                "thumbnailLink": "https://www.3blmedia.com/sites/default/files/styles/thumbnail/public/images/Kevin-at-the-airport_Subaru_020924.jpg",
                "mediumLink": "https://www.3blmedia.com/sites/default/files/styles/medium/public/images/Kevin-at-the-airport_Subaru_020924.jpg",
                "title": "\\\" \\\"",
                "detailsLink": "public://images/Kevin-at-the-airport_Subaru_020924.jpg",
                "imageALT": "\\\" \\\""
              },
              {
                "originalLink": "https://www.3blmedia.com/sites/default/files/styles/fmr_page_photos_blog/public/images/Steve-piper-riley_Subaru_020924.jpg",
                "thumbnailLink": "https://www.3blmedia.com/sites/default/files/styles/thumbnail/public/images/Steve-piper-riley_Subaru_020924.jpg",
                "mediumLink": "https://www.3blmedia.com/sites/default/files/styles/medium/public/images/Steve-piper-riley_Subaru_020924.jpg",
                "title": "\\\" \\\"",
                "detailsLink": "public://images/Steve-piper-riley_Subaru_020924.jpg",
                "imageALT": "\\\" \\\""
              },
              {
                "originalLink": "https://www.3blmedia.com/sites/default/files/styles/fmr_page_photos_blog/public/images/Piper-hospital-therapy_Subaru_020924.jpg",
                "thumbnailLink": "https://www.3blmedia.com/sites/default/files/styles/thumbnail/public/images/Piper-hospital-therapy_Subaru_020924.jpg",
                "mediumLink": "https://www.3blmedia.com/sites/default/files/styles/medium/public/images/Piper-hospital-therapy_Subaru_020924.jpg",
                "title": "\\\" \\\"",
                "detailsLink": "public://images/Piper-hospital-therapy_Subaru_020924.jpg",
                "imageALT": "\\\" \\\""
              },
              {
                "originalLink": "https://www.3blmedia.com/sites/default/files/styles/fmr_page_photos_blog/public/images/Piper_Subaru_020924.jpg",
                "thumbnailLink": "https://www.3blmedia.com/sites/default/files/styles/thumbnail/public/images/Piper_Subaru_020924.jpg",
                "mediumLink": "https://www.3blmedia.com/sites/default/files/styles/medium/public/images/Piper_Subaru_020924.jpg",
                "title": "\\\" \\\"",
                "detailsLink": "public://images/Piper_Subaru_020924.jpg",
                "imageALT": "\\\" \\\""
              },
              {
                "originalLink": "https://www.3blmedia.com/sites/default/files/styles/fmr_page_photos_blog/public/images/Jackson_Subaru_020924.jpg",
                "thumbnailLink": "https://www.3blmedia.com/sites/default/files/styles/thumbnail/public/images/Jackson_Subaru_020924.jpg",
                "mediumLink": "https://www.3blmedia.com/sites/default/files/styles/medium/public/images/Jackson_Subaru_020924.jpg",
                "title": "\\\" \\\"",
                "detailsLink": "public://images/Jackson_Subaru_020924.jpg",
                "imageALT": "\\\" \\\""
              }
            ],
            "video": [],
            "audio": [],
            "document": []
          },
          "blogUrl": {
            "link": null,
            "title": null
          },
          "templateType": "classic",
          "imageUrl": "https://www.3blmedia.com/sites/default/files/styles/fmr_page_photos_mm_medium/public/images/Paws-in-hands_Subaru_020924.jpg",
          "displayTwitter": "none"
        }
      },
      {
        "fmr_id": "1253566",
        "published_date": "2024-03-20T13:15:00",
        "company_nid": "1931",
        "mediatype": "multimedia",
        "fmr_list": {
          "companyName": "The Mastercard Center for Inclusive Growth",
          "companyLink": "https://www.3blmedia.com/profiles/mastercard-center-inclusive-growth",
          "id": "1253566",
          "title": "Mastercard Center for Inclusive Growth Named to Fast Company's Most Innovative Companies of 2024",
          "type": "multimedia",
          "publishedDate": "2024-03-20T13:15:00-04:00",
          "shortTeaser": "We are incredibly proud that the Mastercard Center for Inclusive Growth has been named to Fast Company’s Most Innovative Companies of 2024 in the Corporate Social Responsibility category.",
          "description": "<p><a href=\"https://www.linkedin.com/posts/mastercard_fcmostinnovative-wearemastercard-inclusivegrowth-activity-7175842675122675715-s__w/?utm_source=share&amp;utm_medium=member_desktop\" target=\"_blank\">Mastercard</a></p><p>We are incredibly proud that the <a href=\"https://www.mastercardcenter.org/?cmp=paid.partner.syndicated.engagement.website.all.global.3bl.article\" target=\"_blank\">Mastercard Center for Inclusive Growth</a> has been named to <a href=\"https://www.linkedin.com/company/fast-company/\" target=\"_blank\">Fast Company</a>'s Most Innovative Companies of 2024 in the Corporate Social Responsibility category. We are grateful to everyone at Mastercard who has brought our \"Doing Well by Doing Good\" philosophy to life. This award is a testament to our company-wide commitment to driving equitable and sustainable economic growth and champion financial inclusion and health.</p><p><a href=\"https://www.fastcompany.com/91038447/mastercard-center-inclusive-growth-most-innovative-companies-2024\" target=\"_blank\">https://www.fastcompany.com/91038447/mastercard-center-inclusive-growth-most-innovative-companies-2024</a></p><p><strong>About the Mastercard Center for Inclusive Growth</strong></p><p>The Mastercard Center for Inclusive Growth advances equitable and sustainable economic growth and financial inclusion around the world. The Center leverages Mastercard's core assets and competencies, including data insights, expertise, and technology, while administering the philanthropic Mastercard Impact Fund, to produce independent research, scale global programs and empower a community of thinkers, leaders and doers on the front lines of inclusive growth. For more information and to receive its latest insights, follow the Center on <a href=\"https://www.linkedin.com/showcase/9393243/admin/\" target=\"_blank\" title=\"https://www.linkedin.com/showcase/9393243/admin/\">LinkedIn</a> and <a href=\"https://www.mastercardcenter.org/forms/stay-informed-standalone\" target=\"_blank\" title=\"https://www.mastercardcenter.org/forms/stay-informed-standalone\">subscribe to its newsletter</a>.</p><p><a href=\"https://www.linkedin.com/posts/mastercard_fcmostinnovative-wearemastercard-inclusivegrowth-activity-7175842675122675715-s__w/?utm_source=share&amp;utm_medium=member_desktop\" target=\"_blank\">Originally published by Mastercard</a></p><p><a href=\"https://www.mastercardcenter.org/?cmp=paid.partner.syndicated.engagement.website.all.global.3bl.article\" target=\"_blank\">Follow along the Mastercard Center for Inclusive Growth's journey to advance equitable and sustainable economic growth and financial inclusion around the world</a></p>",
          "linkTo3BL": "https://www.3blmedia.com/",
          "thumbnailLink": "https://www.3blmedia.com/sites/default/files/styles/thumbnail/public/images/fastcompany_MCFIG_031924.jpg",
          "mediumPhotoLink": "https://www.3blmedia.com/sites/default/files/styles/medium/public/images/fastcompany_MCFIG_031924.jpg",
          "imageALT": "Fast Company \\\"We Made The List!\\\" Most innovative companies 2024."
        },
        "fmr_details": {
          "resourceLink": null,
          "resourceText": null,
          "subtitle": "",
          "twitter": null,
          "campaignTitle": "Environmental, Social, and Governance",
          "campaignLink": "https://www.3blmedia.com/news/campaign/environmental-social-and-governance",
          "contactInformation": null,
          "multimedia": {
            "images": [
              {
                "originalLink": "https://www.3blmedia.com/sites/default/files/styles/fmr_page_photos_blog/public/images/fastcompany_MCFIG_031924.jpg",
                "thumbnailLink": "https://www.3blmedia.com/sites/default/files/styles/thumbnail/public/images/fastcompany_MCFIG_031924.jpg",
                "mediumLink": "https://www.3blmedia.com/sites/default/files/styles/medium/public/images/fastcompany_MCFIG_031924.jpg",
                "title": "Fast Company \\\"We Made The List!\\\" Most innovative companies 2024.",
                "detailsLink": "public://images/fastcompany_MCFIG_031924.jpg",
                "imageALT": "Fast Company \\\"We Made The List!\\\" Most innovative companies 2024."
              }
            ],
            "video": [],
            "audio": [],
            "document": []
          },
          "blogUrl": {
            "link": null,
            "title": null
          },
          "templateType": "classic",
          "imageUrl": "https://www.3blmedia.com/sites/default/files/styles/fmr_page_photos_mm_medium/public/images/fastcompany_MCFIG_031924.jpg",
          "displayTwitter": "none"
        }
      },
      {
        "fmr_id": "1252566",
        "published_date": "2024-03-20T13:05:00",
        "company_nid": "911",
        "mediatype": "article",
        "fmr_list": {
          "companyName": "CBRE Group, Inc.",
          "companyLink": "https://www.3blmedia.com/profiles/cbre-group-inc",
          "id": "1252566",
          "title": "CBRE Scores 'Excellent' Green Rating for Glasgow HQ",
          "type": "article",
          "publishedDate": "2024-03-20T13:05:00-04:00",
          "shortTeaser": "CBRE has announced its new headquarters in Glasgow has achieved one of the UK’s highest sustainability ratings.",
          "description": "<p><a href=\"https://news.cbre.co.uk/cbre-scores-excellent-green-rating-for-glasgow-hq/\" target=\"_blank\">CBRE</a></p><p>CBRE has announced its new headquarters in Glasgow has achieved one of the UK's highest sustainability ratings.</p><p>The global real estate advisor's offices at 177 Bothwell Street have been awarded a coveted BREEAM 'Excellent' rating from the Building Research Establishment (BRE), placing it in the top 10% of fit-out projects in the UK.</p><p>CBRE relocated more than 400 employees to the landmark development in January last year as part of a consolidation plan to merge three offices into one and enhance collaboration. The agency occupies the building's ground floor extending to 18,000 sq ft.</p><p>177 Bothwell Street's existing green credentials were a key factor in CBRE selecting it for its West of Scotland hub. It utilises 100% green power from a local source, supporting the advisor's commitments to reduce carbon emissions. The building also features impressive wellness amenities such as a rooftop running track, seating areas and spa-quality changing facilities.</p><blockquote><p>This fantastic excellent rating was achieved thanks to the collaboration of an in-house CBRE team which included Designers, MEP, Project Management and BREEAM Assessors. Unusually, no comments or suggested actions for improvement were raised by BRE on the BREEAM documentation, which is a real testament to the hard work our team put into this. It is important that we are able to demonstrate to our clients that a commitment to reducing the impact office buildings have on the environment should always be at the core of any real estate decision-making process.</p><p><strong>David Smith, Managing Director Scotland</strong></p></blockquote><p>The BREEAM excellent rating for 177 Bothwell Street falls within CBRE's ESG commitments, with over half the buildings occupied in the UK now holding a green certification.</p><blockquote><p>The achievement of the BREEAM standard for 177 Bothwell Street is another major milestone towards CBRE's ESG commitments, and it demonstrates best practice since this office is only one of seven projects achieving BREEAM Excellent in Scotland. The smooth achievement of the certification for this project is testament to the amazing team who participated in the process and the accuracy of the evidence provided.</p><p><strong>Giulia Mori, Health and Wellbeing Lead, ESG Consultancy, CBRE UK</strong></p></blockquote><p>BREEAM is the most widely used sustainability certification in the UK. Its requirements measure the environmental performance of a building under construction or undergoing refurbishment by assessing factors such as materials, waste, energy and water.</p>",
          "linkTo3BL": "https://www.3blmedia.com/",
          "thumbnailLink": "https://www.3blmedia.com/sites/default/files/styles/thumbnail/public/images/177bothwellstreet_CBRE_031224.jpg",
          "mediumPhotoLink": "https://www.3blmedia.com/sites/default/files/styles/medium/public/images/177bothwellstreet_CBRE_031224.jpg",
          "imageALT": "Inside CBRE headquarters"
        },
        "fmr_details": {
          "resourceLink": null,
          "resourceText": null,
          "subtitle": "",
          "twitter": null,
          "campaignTitle": "CBRE UK",
          "campaignLink": "https://www.3blmedia.com/news/campaign/cbre-uk",
          "contactInformation": null,
          "multimedia": {
            "images": [
              {
                "originalLink": "https://www.3blmedia.com/sites/default/files/styles/fmr_page_photos_blog/public/images/177bothwellstreet_CBRE_031224.jpg",
                "thumbnailLink": "https://www.3blmedia.com/sites/default/files/styles/thumbnail/public/images/177bothwellstreet_CBRE_031224.jpg",
                "mediumLink": "https://www.3blmedia.com/sites/default/files/styles/medium/public/images/177bothwellstreet_CBRE_031224.jpg",
                "title": "Inside CBRE headquarters",
                "detailsLink": "public://images/177bothwellstreet_CBRE_031224.jpg",
                "imageALT": "Inside CBRE headquarters"
              }
            ],
            "video": [],
            "audio": [],
            "document": []
          },
          "blogUrl": {
            "link": null,
            "title": null
          },
          "templateType": "classic",
          "imageUrl": "https://www.3blmedia.com/sites/default/files/styles/fmr_page_photos_mm_medium/public/images/177bothwellstreet_CBRE_031224.jpg",
          "displayTwitter": "none"
        }
      }
    ]
  },
  "intFmrId": 0,
  "base_url": "http://3blpronew.docksal.site",
  "strFeaturedHtml": "",
  "refreshPageCount": 1
}